Model Exp2019-01-31_22-37-33 has been started to be evaluated.
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 224, 224, 3)       0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 224, 224, 64)      1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 224, 224, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 112, 112, 64)      0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 112, 112, 128)     73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 112, 112, 128)     147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 56, 56, 128)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 56, 56, 256)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 28, 28, 256)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 28, 28, 512)       1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 14, 14, 512)       0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_pool (MaxPooling2D)   (None, 7, 7, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 25088)             0         
_________________________________________________________________
fc1 (Dense)                  (None, 4096)              102764544 
_________________________________________________________________
fc2 (Dense)                  (None, 4096)              16781312  
_________________________________________________________________
dropout3_025 (Dropout)       (None, 4096)              0         
_________________________________________________________________
fc1024 (Dense)               (None, 1024)              4195328   
_________________________________________________________________
dropout_025 (Dropout)        (None, 1024)              0         
=================================================================
Total params: 138,455,872
Trainable params: 4,195,328
Non-trainable params: 134,260,544
_________________________________________________________________

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
model_1 (Model)              (None, 1024)              138455872 
_________________________________________________________________
dense_1 (Dense)              (None, 3)                 3075      
=================================================================
Total params: 138,458,947
Trainable params: 4,198,403
Non-trainable params: 134,260,544
_________________________________________________________________

######## CONF_Begins_Here ##########
confFile = 'CNN_Configuration.py'
RECORD = True # False # 

output_begin = 3
num_outputs = 3

timesteps = 1 # TimeseriesGenerator Handles overlapping
learning_rate =  0.0001
in_epochs = 10
out_epochs = 1
train_batch_size = 10
test_batch_size = 1

subjectList = [i for i in range(1, 25)] # [1, 2, 3, 4, 5, 7, 8, 11, 12, 14] #  [9, 1] #
testSubjects = [3, 5, 9, 14] # [9, 18, 21, 24] # [9] # 
trainingSubjects = [s for s in subjectList if not s in testSubjects] # subjectList # 

num_datasets = len(subjectList)

include_vgg_top = True # False # 

angles = ['Pitch', 'Yaw', 'Roll'] 
use_vgg16 = True # False # 
######### CONF_ends_Here ###########
The subjects are trained: [(16, 'M09'), (11, 'M05'), (13, 'M07'), (12, 'M06'), (10, 'M04'), (6, 'F06'), (2, 'F02'), (17, 'M10'), (15, 'F03'), (20, 'M12'), (4, 'F04'), (8, 'M02'), (19, 'M11'), (21, 'F02'), (23, 'M13'), (1, 'F01'), (7, 'M01'), (24, 'M14'), (22, 'M01'), (18, 'F05')]
Evaluating model CNN_VGG16_inc_top_output3_BatchSize10_inEpochs10_outEpochs1_AdamOpt_lr-0.000100_2019-01-31_22-37-33
The subjects will be tested: [(3, 'F03'), (5, 'F05'), (9, 'M03'), (14, 'M08')]
For the Subject 3 (F03):
	The absolute mean error on Pitch angle estimation: 17.50 Degree
	The absolute mean error on Yaw angle estimation: 35.01 Degree
	The absolute mean error on Roll angle estimation: 4.44 Degree
For the Subject 5 (F05):
	The absolute mean error on Pitch angle estimation: 17.30 Degree
	The absolute mean error on Yaw angle estimation: 27.71 Degree
	The absolute mean error on Roll angle estimation: 3.72 Degree
For the Subject 9 (M03):
	The absolute mean error on Pitch angle estimation: 31.40 Degree
	The absolute mean error on Yaw angle estimation: 29.87 Degree
	The absolute mean error on Roll angle estimation: 7.72 Degree
For the Subject 14 (M08):
	The absolute mean error on Pitch angle estimation: 26.02 Degree
	The absolute mean error on Yaw angle estimation: 36.59 Degree
	The absolute mean error on Roll angle estimation: 14.31 Degree
On average in 4 test subjects:
	The absolute mean error on Pitch angle estimations: 23.05 Degree
	The absolute mean error on Yaw angle estimations: 32.29 Degree
	The absolute mean error on Roll angle estimations: 7.55 Degree
Exp2019-01-31_22-37-33 completed!
Experiment 1 completed!
Exp2019-01-31_22-37-33.h5 has been saved.
subject3_Exp2019-01-31_22-37-33.png has been saved by 2019-01-31 22:57:40.894146.
subject5_Exp2019-01-31_22-37-33.png has been saved by 2019-01-31 22:57:41.100511.
subject9_Exp2019-01-31_22-37-33.png has been saved by 2019-01-31 22:57:41.304508.
subject14_Exp2019-01-31_22-37-33.png has been saved by 2019-01-31 22:57:41.530556.
Model Exp2019-01-31_22-37-33 has been evaluated successfully.
