Model Exp2019-01-24_00-14-10 has been started to be evaluated.
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 224, 224, 3)       0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 224, 224, 64)      1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 224, 224, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 112, 112, 64)      0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 112, 112, 128)     73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 112, 112, 128)     147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 56, 56, 128)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 56, 56, 256)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 28, 28, 256)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 28, 28, 512)       1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 14, 14, 512)       0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_pool (MaxPooling2D)   (None, 7, 7, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 25088)             0         
_________________________________________________________________
fc1 (Dense)                  (None, 4096)              102764544 
_________________________________________________________________
fc2 (Dense)                  (None, 4096)              16781312  
=================================================================
Total params: 134,260,544
Trainable params: 0
Non-trainable params: 134,260,544
_________________________________________________________________

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
tdVGG16 (TimeDistributed)    (1, 1, 4096)              134260544 
_________________________________________________________________
dropout025 (TimeDistributed) (1, 1, 4096)              0         
_________________________________________________________________
lstm_1 (LSTM)                (1, 320)                  5653760   
_________________________________________________________________
dense_1 (Dense)              (1, 3)                    963       
=================================================================
Total params: 139,915,267
Trainable params: 5,654,723
Non-trainable params: 134,260,544
_________________________________________________________________

######## CONF_Begins_Here ##########
confFile = 'Stateful_CNN_LSTM_Configuration.py'
RECORD = True # False # 

output_begin = 3
num_outputs = 3

timesteps = 1 # TimeseriesGenerator Handles overlapping
learning_rate = 0.0001
in_epochs = 1
out_epochs = 7
train_batch_size = 1
test_batch_size = 1

subjectList = [i for i in range(1, 25)] # [1, 2, 3, 4, 5, 7, 8, 11, 12, 14] # [9] # 
testSubjects = [1] # [9, 18, 21, 24] # [9, 18, 21, 24] # 
trainingSubjects = [s for s in subjectList if not s in testSubjects] # subjectList #

num_datasets = len(subjectList)

lstm_nodes = 320
lstm_dropout = 0.25
lstm_recurrent_dropout = 0.25
include_vgg_top = True 

angles = ['Pitch', 'Yaw', 'Roll'] 
######### CONF_ends_Here ###########
1. set (Dataset 24) being trained for epoch 1 by 2019-01-24 00:14:20.367791!
2. set (Dataset 23) being trained for epoch 1 by 2019-01-24 00:14:37.370609!
3. set (Dataset 13) being trained for epoch 1 by 2019-01-24 00:14:53.388002!
4. set (Dataset 15) being trained for epoch 1 by 2019-01-24 00:15:09.287715!
5. set (Dataset 12) being trained for epoch 1 by 2019-01-24 00:15:29.441325!
6. set (Dataset 3) being trained for epoch 1 by 2019-01-24 00:15:51.271054!
7. set (Dataset 20) being trained for epoch 1 by 2019-01-24 00:16:11.288108!
8. set (Dataset 7) being trained for epoch 1 by 2019-01-24 00:16:30.223344!
9. set (Dataset 21) being trained for epoch 1 by 2019-01-24 00:16:51.131035!
10. set (Dataset 22) being trained for epoch 1 by 2019-01-24 00:17:10.127894!
11. set (Dataset 16) being trained for epoch 1 by 2019-01-24 00:17:32.095925!
12. set (Dataset 19) being trained for epoch 1 by 2019-01-24 00:17:55.123992!
13. set (Dataset 10) being trained for epoch 1 by 2019-01-24 00:18:12.288047!
14. set (Dataset 8) being trained for epoch 1 by 2019-01-24 00:18:34.525732!
15. set (Dataset 2) being trained for epoch 1 by 2019-01-24 00:18:54.992673!
16. set (Dataset 18) being trained for epoch 1 by 2019-01-24 00:19:11.081112!
17. set (Dataset 4) being trained for epoch 1 by 2019-01-24 00:19:30.536063!
18. set (Dataset 6) being trained for epoch 1 by 2019-01-24 00:19:50.349055!
19. set (Dataset 17) being trained for epoch 1 by 2019-01-24 00:20:04.746377!
20. set (Dataset 14) being trained for epoch 1 by 2019-01-24 00:20:20.965818!
21. set (Dataset 5) being trained for epoch 1 by 2019-01-24 00:20:45.862786!
22. set (Dataset 11) being trained for epoch 1 by 2019-01-24 00:21:10.412217!
23. set (Dataset 9) being trained for epoch 1 by 2019-01-24 00:21:30.610018!
Epoch 1 completed!
1. set (Dataset 9) being trained for epoch 2 by 2019-01-24 00:22:02.458454!
2. set (Dataset 11) being trained for epoch 2 by 2019-01-24 00:22:25.631726!
3. set (Dataset 19) being trained for epoch 2 by 2019-01-24 00:22:41.781451!
4. set (Dataset 8) being trained for epoch 2 by 2019-01-24 00:22:59.622486!
5. set (Dataset 16) being trained for epoch 2 by 2019-01-24 00:23:24.046897!
6. set (Dataset 23) being trained for epoch 2 by 2019-01-24 00:23:47.829042!
7. set (Dataset 17) being trained for epoch 2 by 2019-01-24 00:24:03.033219!
8. set (Dataset 3) being trained for epoch 2 by 2019-01-24 00:24:18.269691!
9. set (Dataset 14) being trained for epoch 2 by 2019-01-24 00:24:40.794278!
10. set (Dataset 5) being trained for epoch 2 by 2019-01-24 00:25:06.038876!
11. set (Dataset 2) being trained for epoch 2 by 2019-01-24 00:25:29.854535!
12. set (Dataset 6) being trained for epoch 2 by 2019-01-24 00:25:45.289821!
13. set (Dataset 21) being trained for epoch 2 by 2019-01-24 00:26:02.078605!
14. set (Dataset 20) being trained for epoch 2 by 2019-01-24 00:26:20.040185!
15. set (Dataset 24) being trained for epoch 2 by 2019-01-24 00:26:35.706292!
16. set (Dataset 4) being trained for epoch 2 by 2019-01-24 00:26:52.867492!
17. set (Dataset 13) being trained for epoch 2 by 2019-01-24 00:27:12.476686!
18. set (Dataset 12) being trained for epoch 2 by 2019-01-24 00:27:29.559234!
19. set (Dataset 18) being trained for epoch 2 by 2019-01-24 00:27:50.029635!
20. set (Dataset 10) being trained for epoch 2 by 2019-01-24 00:28:09.464538!
21. set (Dataset 15) being trained for epoch 2 by 2019-01-24 00:28:30.401724!
22. set (Dataset 22) being trained for epoch 2 by 2019-01-24 00:28:50.082675!
23. set (Dataset 7) being trained for epoch 2 by 2019-01-24 00:29:11.088780!
Epoch 2 completed!
1. set (Dataset 7) being trained for epoch 3 by 2019-01-24 00:29:39.039605!
2. set (Dataset 22) being trained for epoch 3 by 2019-01-24 00:30:00.638743!
3. set (Dataset 6) being trained for epoch 3 by 2019-01-24 00:30:19.074834!
4. set (Dataset 20) being trained for epoch 3 by 2019-01-24 00:30:35.174096!
5. set (Dataset 2) being trained for epoch 3 by 2019-01-24 00:30:51.272148!
6. set (Dataset 11) being trained for epoch 3 by 2019-01-24 00:31:07.179022!
7. set (Dataset 18) being trained for epoch 3 by 2019-01-24 00:31:24.509514!
8. set (Dataset 23) being trained for epoch 3 by 2019-01-24 00:31:42.192746!
9. set (Dataset 10) being trained for epoch 3 by 2019-01-24 00:32:00.660543!
10. set (Dataset 15) being trained for epoch 3 by 2019-01-24 00:32:21.563241!
11. set (Dataset 24) being trained for epoch 3 by 2019-01-24 00:32:39.427931!
12. set (Dataset 12) being trained for epoch 3 by 2019-01-24 00:32:56.437724!
13. set (Dataset 14) being trained for epoch 3 by 2019-01-24 00:33:19.144919!
14. set (Dataset 17) being trained for epoch 3 by 2019-01-24 00:33:38.949042!
15. set (Dataset 9) being trained for epoch 3 by 2019-01-24 00:33:55.597401!
16. set (Dataset 13) being trained for epoch 3 by 2019-01-24 00:34:18.065075!
17. set (Dataset 19) being trained for epoch 3 by 2019-01-24 00:34:32.658558!
18. set (Dataset 16) being trained for epoch 3 by 2019-01-24 00:34:50.916323!
19. set (Dataset 4) being trained for epoch 3 by 2019-01-24 00:35:16.503968!
20. set (Dataset 21) being trained for epoch 3 by 2019-01-24 00:35:37.449121!
21. set (Dataset 8) being trained for epoch 3 by 2019-01-24 00:35:57.784014!
22. set (Dataset 5) being trained for epoch 3 by 2019-01-24 00:36:22.411679!
23. set (Dataset 3) being trained for epoch 3 by 2019-01-24 00:36:48.759814!
Epoch 3 completed!
1. set (Dataset 3) being trained for epoch 4 by 2019-01-24 00:37:15.926178!
2. set (Dataset 5) being trained for epoch 4 by 2019-01-24 00:37:39.886574!
3. set (Dataset 12) being trained for epoch 4 by 2019-01-24 00:38:05.879334!
4. set (Dataset 17) being trained for epoch 4 by 2019-01-24 00:38:24.051097!
5. set (Dataset 24) being trained for epoch 4 by 2019-01-24 00:38:36.491357!
6. set (Dataset 22) being trained for epoch 4 by 2019-01-24 00:38:52.686785!
7. set (Dataset 4) being trained for epoch 4 by 2019-01-24 00:39:13.293439!
8. set (Dataset 11) being trained for epoch 4 by 2019-01-24 00:39:33.650247!
9. set (Dataset 21) being trained for epoch 4 by 2019-01-24 00:39:50.924955!
10. set (Dataset 8) being trained for epoch 4 by 2019-01-24 00:40:11.157400!
11. set (Dataset 9) being trained for epoch 4 by 2019-01-24 00:40:35.391176!
12. set (Dataset 16) being trained for epoch 4 by 2019-01-24 00:41:01.702136!
13. set (Dataset 10) being trained for epoch 4 by 2019-01-24 00:41:26.942134!
14. set (Dataset 18) being trained for epoch 4 by 2019-01-24 00:41:47.160996!
15. set (Dataset 7) being trained for epoch 4 by 2019-01-24 00:42:06.880645!
16. set (Dataset 19) being trained for epoch 4 by 2019-01-24 00:42:26.400693!
17. set (Dataset 6) being trained for epoch 4 by 2019-01-24 00:42:41.596511!
18. set (Dataset 2) being trained for epoch 4 by 2019-01-24 00:42:57.596143!
19. set (Dataset 13) being trained for epoch 4 by 2019-01-24 00:43:12.634496!
20. set (Dataset 14) being trained for epoch 4 by 2019-01-24 00:43:30.201252!
21. set (Dataset 20) being trained for epoch 4 by 2019-01-24 00:43:51.351894!
22. set (Dataset 15) being trained for epoch 4 by 2019-01-24 00:44:08.615526!
23. set (Dataset 23) being trained for epoch 4 by 2019-01-24 00:44:26.912200!
Epoch 4 completed!
1. set (Dataset 23) being trained for epoch 5 by 2019-01-24 00:44:49.199864!
2. set (Dataset 15) being trained for epoch 5 by 2019-01-24 00:45:06.853407!
3. set (Dataset 16) being trained for epoch 5 by 2019-01-24 00:45:28.485731!
4. set (Dataset 18) being trained for epoch 5 by 2019-01-24 00:45:52.513398!
5. set (Dataset 9) being trained for epoch 5 by 2019-01-24 00:46:13.504074!
6. set (Dataset 5) being trained for epoch 5 by 2019-01-24 00:46:40.056871!
7. set (Dataset 13) being trained for epoch 5 by 2019-01-24 00:47:03.888305!
8. set (Dataset 22) being trained for epoch 5 by 2019-01-24 00:47:19.969523!
9. set (Dataset 14) being trained for epoch 5 by 2019-01-24 00:47:41.481379!
10. set (Dataset 20) being trained for epoch 5 by 2019-01-24 00:48:02.765847!
11. set (Dataset 7) being trained for epoch 5 by 2019-01-24 00:48:21.200613!
12. set (Dataset 2) being trained for epoch 5 by 2019-01-24 00:48:40.869145!
13. set (Dataset 21) being trained for epoch 5 by 2019-01-24 00:48:57.063052!
14. set (Dataset 4) being trained for epoch 5 by 2019-01-24 00:49:17.056073!
15. set (Dataset 3) being trained for epoch 5 by 2019-01-24 00:49:39.086053!
16. set (Dataset 6) being trained for epoch 5 by 2019-01-24 00:49:58.961211!
17. set (Dataset 12) being trained for epoch 5 by 2019-01-24 00:50:16.987581!
18. set (Dataset 24) being trained for epoch 5 by 2019-01-24 00:50:36.209953!
19. set (Dataset 19) being trained for epoch 5 by 2019-01-24 00:50:50.944146!
20. set (Dataset 10) being trained for epoch 5 by 2019-01-24 00:51:08.007229!
21. set (Dataset 17) being trained for epoch 5 by 2019-01-24 00:51:26.138992!
22. set (Dataset 8) being trained for epoch 5 by 2019-01-24 00:51:41.693023!
23. set (Dataset 11) being trained for epoch 5 by 2019-01-24 00:52:02.523085!
Epoch 5 completed!
1. set (Dataset 11) being trained for epoch 6 by 2019-01-24 00:52:25.368922!
2. set (Dataset 8) being trained for epoch 6 by 2019-01-24 00:52:44.564149!
3. set (Dataset 2) being trained for epoch 6 by 2019-01-24 00:53:05.104415!
4. set (Dataset 4) being trained for epoch 6 by 2019-01-24 00:53:22.588654!
5. set (Dataset 7) being trained for epoch 6 by 2019-01-24 00:53:44.826397!
6. set (Dataset 15) being trained for epoch 6 by 2019-01-24 00:54:06.017035!
7. set (Dataset 19) being trained for epoch 6 by 2019-01-24 00:54:23.865738!
8. set (Dataset 5) being trained for epoch 6 by 2019-01-24 00:54:42.936226!
9. set (Dataset 10) being trained for epoch 6 by 2019-01-24 00:55:09.051255!
10. set (Dataset 17) being trained for epoch 6 by 2019-01-24 00:55:27.267657!
11. set (Dataset 3) being trained for epoch 6 by 2019-01-24 00:55:42.506875!
12. set (Dataset 24) being trained for epoch 6 by 2019-01-24 00:56:01.731011!
13. set (Dataset 14) being trained for epoch 6 by 2019-01-24 00:56:19.448147!
14. set (Dataset 13) being trained for epoch 6 by 2019-01-24 00:56:40.098277!
15. set (Dataset 23) being trained for epoch 6 by 2019-01-24 00:56:55.186102!
16. set (Dataset 12) being trained for epoch 6 by 2019-01-24 00:57:13.712362!
17. set (Dataset 16) being trained for epoch 6 by 2019-01-24 00:57:37.058438!
18. set (Dataset 9) being trained for epoch 6 by 2019-01-24 00:58:04.312128!
19. set (Dataset 6) being trained for epoch 6 by 2019-01-24 00:58:27.263793!
20. set (Dataset 21) being trained for epoch 6 by 2019-01-24 00:58:44.198518!
21. set (Dataset 18) being trained for epoch 6 by 2019-01-24 00:59:02.627428!
22. set (Dataset 20) being trained for epoch 6 by 2019-01-24 00:59:20.098275!
23. set (Dataset 22) being trained for epoch 6 by 2019-01-24 00:59:37.646591!
Epoch 6 completed!
1. set (Dataset 22) being trained for epoch 7 by 2019-01-24 01:00:02.888536!
2. set (Dataset 20) being trained for epoch 7 by 2019-01-24 01:00:21.398403!
3. set (Dataset 24) being trained for epoch 7 by 2019-01-24 01:00:37.066929!
4. set (Dataset 13) being trained for epoch 7 by 2019-01-24 01:00:51.648407!
5. set (Dataset 3) being trained for epoch 7 by 2019-01-24 01:01:08.640314!
6. set (Dataset 8) being trained for epoch 7 by 2019-01-24 01:01:31.037025!
7. set (Dataset 6) being trained for epoch 7 by 2019-01-24 01:01:51.843711!
8. set (Dataset 15) being trained for epoch 7 by 2019-01-24 01:02:09.084781!
9. set (Dataset 21) being trained for epoch 7 by 2019-01-24 01:02:28.186129!
10. set (Dataset 18) being trained for epoch 7 by 2019-01-24 01:02:46.640976!
11. set (Dataset 23) being trained for epoch 7 by 2019-01-24 01:03:04.239942!
12. set (Dataset 9) being trained for epoch 7 by 2019-01-24 01:03:24.450331!
13. set (Dataset 10) being trained for epoch 7 by 2019-01-24 01:03:49.104926!
14. set (Dataset 19) being trained for epoch 7 by 2019-01-24 01:04:08.526341!
15. set (Dataset 11) being trained for epoch 7 by 2019-01-24 01:04:24.339647!
16. set (Dataset 16) being trained for epoch 7 by 2019-01-24 01:04:44.248814!
17. set (Dataset 2) being trained for epoch 7 by 2019-01-24 01:05:07.564733!
18. set (Dataset 7) being trained for epoch 7 by 2019-01-24 01:05:25.443541!
19. set (Dataset 12) being trained for epoch 7 by 2019-01-24 01:05:47.823225!
20. set (Dataset 14) being trained for epoch 7 by 2019-01-24 01:06:10.433555!
21. set (Dataset 4) being trained for epoch 7 by 2019-01-24 01:06:33.822707!
22. set (Dataset 17) being trained for epoch 7 by 2019-01-24 01:06:52.260003!
23. set (Dataset 5) being trained for epoch 7 by 2019-01-24 01:07:09.308486!
Epoch 7 completed!
Exp2019-01-24_00-14-10.h5 has been saved.
The subjects are trained: [(22, 'M01'), (20, 'M12'), (24, 'M14'), (13, 'M07'), (3, 'F03'), (8, 'M02'), (6, 'F06'), (15, 'F03'), (21, 'F02'), (18, 'F05'), (23, 'M13'), (9, 'M03'), (10, 'M04'), (19, 'M11'), (11, 'M05'), (16, 'M09'), (2, 'F02'), (7, 'M01'), (12, 'M06'), (14, 'M08'), (4, 'F04'), (17, 'M10'), (5, 'F05')]
Evaluating model VGG16_inc_top_seqLen1_stateful_lstm320_output3_BatchSize1_inEpochs1_outEpochs7_AdamOpt_lr-0.000100_2019-01-24_00-14-10
The subjects will be tested: [(1, 'F01')]
For the Subject 1 (F01):
	The absolute mean error on Pitch angle estimation: 9.36 Degree
	The absolute mean error on Yaw angle estimation: 31.38 Degree
	The absolute mean error on Roll angle estimation: 3.70 Degree
On average in 1 test subjects:
	The absolute mean error on Pitch angle estimations: 9.36 Degree
	The absolute mean error on Yaw angle estimations: 31.38 Degree
	The absolute mean error on Roll angle estimations: 3.70 Degree
subject1_Exp2019-01-24_00-14-10.png has been saved by 2019-01-24 01:07:40.780126.
Model Exp2019-01-24_00-14-10 has been evaluated successfully.
