Model Exp2019-01-23_00-15-57 has been started to be evaluated.
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 224, 224, 3)       0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 224, 224, 64)      1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 224, 224, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 112, 112, 64)      0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 112, 112, 128)     73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 112, 112, 128)     147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 56, 56, 128)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 56, 56, 256)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 28, 28, 256)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 28, 28, 512)       1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 14, 14, 512)       0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_pool (MaxPooling2D)   (None, 7, 7, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 25088)             0         
_________________________________________________________________
fc1 (Dense)                  (None, 4096)              102764544 
_________________________________________________________________
fc2 (Dense)                  (None, 4096)              16781312  
=================================================================
Total params: 134,260,544
Trainable params: 0
Non-trainable params: 134,260,544
_________________________________________________________________

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
tdVGG16 (TimeDistributed)    (1, 1, 4096)              134260544 
_________________________________________________________________
time_distributed_1 (TimeDist (1, 1, 4096)              0         
_________________________________________________________________
fc10 (TimeDistributed)       (1, 1, 1024)              4195328   
_________________________________________________________________
time_distributed_2 (TimeDist (1, 1, 1024)              0         
_________________________________________________________________
lstm_1 (LSTM)                (1, 320)                  1721600   
_________________________________________________________________
dense_2 (Dense)              (1, 3)                    963       
=================================================================
Total params: 140,178,435
Trainable params: 5,917,891
Non-trainable params: 134,260,544
_________________________________________________________________

1. set (Subject 24, M14) being trained for epoch 1!
2. set (Subject 11, M05) being trained for epoch 1!
3. set (Subject 21, F02) being trained for epoch 1!
4. set (Subject 15, F03) being trained for epoch 1!
5. set (Subject 12, M06) being trained for epoch 1!
6. set (Subject 2, F02) being trained for epoch 1!
7. set (Subject 17, M10) being trained for epoch 1!
8. set (Subject 6, F06) being trained for epoch 1!
9. set (Subject 23, M13) being trained for epoch 1!
10. set (Subject 14, M08) being trained for epoch 1!
11. set (Subject 22, M01) being trained for epoch 1!
12. set (Subject 20, M12) being trained for epoch 1!
13. set (Subject 19, M11) being trained for epoch 1!
14. set (Subject 9, M03) being trained for epoch 1!
15. set (Subject 7, M01) being trained for epoch 1!
16. set (Subject 1, F01) being trained for epoch 1!
17. set (Subject 18, F05) being trained for epoch 1!
18. set (Subject 3, F03) being trained for epoch 1!
19. set (Subject 5, F05) being trained for epoch 1!
20. set (Subject 16, M09) being trained for epoch 1!
21. set (Subject 13, M07) being trained for epoch 1!
22. set (Subject 4, F04) being trained for epoch 1!
23. set (Subject 10, M04) being trained for epoch 1!
24. set (Subject 8, M02) being trained for epoch 1!
Epoch 1 completed!
1. set (Subject 8, M02) being trained for epoch 2!
2. set (Subject 22, M01) being trained for epoch 2!
3. set (Subject 13, M07) being trained for epoch 2!
4. set (Subject 7, M01) being trained for epoch 2!
5. set (Subject 20, M12) being trained for epoch 2!
6. set (Subject 11, M05) being trained for epoch 2!
7. set (Subject 18, F05) being trained for epoch 2!
8. set (Subject 2, F02) being trained for epoch 2!
9. set (Subject 10, M04) being trained for epoch 2!
10. set (Subject 9, M03) being trained for epoch 2!
11. set (Subject 4, F04) being trained for epoch 2!
12. set (Subject 16, M09) being trained for epoch 2!
13. set (Subject 5, F05) being trained for epoch 2!
14. set (Subject 23, M13) being trained for epoch 2!
15. set (Subject 17, M10) being trained for epoch 2!
16. set (Subject 24, M14) being trained for epoch 2!
17. set (Subject 3, F03) being trained for epoch 2!
18. set (Subject 21, F02) being trained for epoch 2!
19. set (Subject 12, M06) being trained for epoch 2!
20. set (Subject 1, F01) being trained for epoch 2!
21. set (Subject 19, M11) being trained for epoch 2!
22. set (Subject 15, F03) being trained for epoch 2!
23. set (Subject 14, M08) being trained for epoch 2!
24. set (Subject 6, F06) being trained for epoch 2!
Epoch 2 completed!
1. set (Subject 6, F06) being trained for epoch 3!
2. set (Subject 4, F04) being trained for epoch 3!
3. set (Subject 19, M11) being trained for epoch 3!
4. set (Subject 17, M10) being trained for epoch 3!
5. set (Subject 16, M09) being trained for epoch 3!
6. set (Subject 22, M01) being trained for epoch 3!
7. set (Subject 3, F03) being trained for epoch 3!
8. set (Subject 11, M05) being trained for epoch 3!
9. set (Subject 14, M08) being trained for epoch 3!
10. set (Subject 23, M13) being trained for epoch 3!
11. set (Subject 15, F03) being trained for epoch 3!
12. set (Subject 1, F01) being trained for epoch 3!
13. set (Subject 12, M06) being trained for epoch 3!
14. set (Subject 10, M04) being trained for epoch 3!
15. set (Subject 18, F05) being trained for epoch 3!
16. set (Subject 8, M02) being trained for epoch 3!
17. set (Subject 21, F02) being trained for epoch 3!
18. set (Subject 13, M07) being trained for epoch 3!
19. set (Subject 20, M12) being trained for epoch 3!
20. set (Subject 24, M14) being trained for epoch 3!
21. set (Subject 5, F05) being trained for epoch 3!
22. set (Subject 7, M01) being trained for epoch 3!
23. set (Subject 9, M03) being trained for epoch 3!
24. set (Subject 2, F02) being trained for epoch 3!
Epoch 3 completed!
1. set (Subject 2, F02) being trained for epoch 4!
2. set (Subject 15, F03) being trained for epoch 4!
3. set (Subject 5, F05) being trained for epoch 4!
4. set (Subject 18, F05) being trained for epoch 4!
5. set (Subject 1, F01) being trained for epoch 4!
6. set (Subject 4, F04) being trained for epoch 4!
7. set (Subject 21, F02) being trained for epoch 4!
8. set (Subject 22, M01) being trained for epoch 4!
9. set (Subject 9, M03) being trained for epoch 4!
10. set (Subject 10, M04) being trained for epoch 4!
11. set (Subject 7, M01) being trained for epoch 4!
12. set (Subject 24, M14) being trained for epoch 4!
13. set (Subject 20, M12) being trained for epoch 4!
14. set (Subject 14, M08) being trained for epoch 4!
15. set (Subject 3, F03) being trained for epoch 4!
16. set (Subject 6, F06) being trained for epoch 4!
17. set (Subject 13, M07) being trained for epoch 4!
18. set (Subject 19, M11) being trained for epoch 4!
19. set (Subject 16, M09) being trained for epoch 4!
20. set (Subject 8, M02) being trained for epoch 4!
21. set (Subject 12, M06) being trained for epoch 4!
22. set (Subject 17, M10) being trained for epoch 4!
23. set (Subject 23, M13) being trained for epoch 4!
24. set (Subject 11, M05) being trained for epoch 4!
Epoch 4 completed!
1. set (Subject 11, M05) being trained for epoch 5!
2. set (Subject 7, M01) being trained for epoch 5!
3. set (Subject 12, M06) being trained for epoch 5!
4. set (Subject 3, F03) being trained for epoch 5!
5. set (Subject 24, M14) being trained for epoch 5!
6. set (Subject 15, F03) being trained for epoch 5!
7. set (Subject 13, M07) being trained for epoch 5!
8. set (Subject 4, F04) being trained for epoch 5!
9. set (Subject 23, M13) being trained for epoch 5!
10. set (Subject 14, M08) being trained for epoch 5!
11. set (Subject 17, M10) being trained for epoch 5!
12. set (Subject 8, M02) being trained for epoch 5!
13. set (Subject 16, M09) being trained for epoch 5!
14. set (Subject 9, M03) being trained for epoch 5!
15. set (Subject 21, F02) being trained for epoch 5!
16. set (Subject 2, F02) being trained for epoch 5!
17. set (Subject 19, M11) being trained for epoch 5!
18. set (Subject 5, F05) being trained for epoch 5!
19. set (Subject 1, F01) being trained for epoch 5!
20. set (Subject 6, F06) being trained for epoch 5!
21. set (Subject 20, M12) being trained for epoch 5!
22. set (Subject 18, F05) being trained for epoch 5!
23. set (Subject 10, M04) being trained for epoch 5!
24. set (Subject 22, M01) being trained for epoch 5!
Epoch 5 completed!
1. set (Subject 22, M01) being trained for epoch 6!
2. set (Subject 17, M10) being trained for epoch 6!
3. set (Subject 20, M12) being trained for epoch 6!
4. set (Subject 21, F02) being trained for epoch 6!
5. set (Subject 8, M02) being trained for epoch 6!
6. set (Subject 7, M01) being trained for epoch 6!
7. set (Subject 19, M11) being trained for epoch 6!
8. set (Subject 15, F03) being trained for epoch 6!
9. set (Subject 10, M04) being trained for epoch 6!
10. set (Subject 9, M03) being trained for epoch 6!
11. set (Subject 18, F05) being trained for epoch 6!
12. set (Subject 6, F06) being trained for epoch 6!
13. set (Subject 1, F01) being trained for epoch 6!
14. set (Subject 23, M13) being trained for epoch 6!
15. set (Subject 13, M07) being trained for epoch 6!
16. set (Subject 11, M05) being trained for epoch 6!
17. set (Subject 5, F05) being trained for epoch 6!
18. set (Subject 12, M06) being trained for epoch 6!
19. set (Subject 24, M14) being trained for epoch 6!
20. set (Subject 2, F02) being trained for epoch 6!
21. set (Subject 16, M09) being trained for epoch 6!
22. set (Subject 3, F03) being trained for epoch 6!
23. set (Subject 14, M08) being trained for epoch 6!
24. set (Subject 4, F04) being trained for epoch 6!
Epoch 6 completed!
Exp2019-01-23_00-15-57.h5 has been saved.
The subjects are trained: [(22, 'M01'), (17, 'M10'), (20, 'M12'), (21, 'F02'), (8, 'M02'), (7, 'M01'), (19, 'M11'), (15, 'F03'), (10, 'M04'), (9, 'M03'), (18, 'F05'), (6, 'F06'), (1, 'F01'), (23, 'M13'), (13, 'M07'), (11, 'M05'), (5, 'F05'), (12, 'M06'), (24, 'M14'), (2, 'F02'), (16, 'M09'), (3, 'F03'), (14, 'M08'), (4, 'F04')]
Evaluating model VGG16_inc_top_seqLen1_stateful_lstm320_output3_BatchSize1_inEpochs1_outEpochs6_AdamOpt_lr-0.000100_2019-01-23_00-15-57
The subjects will be tested: [(9, 'M03'), (18, 'F05'), (21, 'F02'), (24, 'M14')]
For the Subject 9 (M03):
	The absolute mean error on Pitch angle estimation: 4.76 Degree
	The absolute mean error on Yaw angle estimation: 7.48 Degree
	The absolute mean error on Roll angle estimation: 2.92 Degree
For the Subject 18 (F05):
	The absolute mean error on Pitch angle estimation: 10.47 Degree
	The absolute mean error on Yaw angle estimation: 9.20 Degree
	The absolute mean error on Roll angle estimation: 5.60 Degree
For the Subject 21 (F02):
	The absolute mean error on Pitch angle estimation: 13.03 Degree
	The absolute mean error on Yaw angle estimation: 6.52 Degree
	The absolute mean error on Roll angle estimation: 8.73 Degree
For the Subject 24 (M14):
	The absolute mean error on Pitch angle estimation: 6.17 Degree
	The absolute mean error on Yaw angle estimation: 6.49 Degree
	The absolute mean error on Roll angle estimation: 2.97 Degree
On average in 4 test subjects:
	The absolute mean error on Pitch angle estimations: 8.61 Degree
	The absolute mean error on Yaw angle estimations: 7.42 Degree
	The absolute mean error on Roll angle estimations: 5.06 Degree
subject9_Exp2019-01-23_00-15-57.png has been saved by 2019-01-23 01:11:17.332033.
subject18_Exp2019-01-23_00-15-57.png has been saved by 2019-01-23 01:11:17.539322.
subject21_Exp2019-01-23_00-15-57.png has been saved by 2019-01-23 01:11:17.747428.
subject24_Exp2019-01-23_00-15-57.png has been saved by 2019-01-23 01:11:17.945660.
Model Exp2019-01-23_00-15-57 has been evaluated successfully.
