Model Exp2019-01-29_22-30-51 has been started to be evaluated.
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 224, 224, 3)       0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 224, 224, 64)      1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 224, 224, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 112, 112, 64)      0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 112, 112, 128)     73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 112, 112, 128)     147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 56, 56, 128)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 56, 56, 256)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 28, 28, 256)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 28, 28, 512)       1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 14, 14, 512)       0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_pool (MaxPooling2D)   (None, 7, 7, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 25088)             0         
_________________________________________________________________
fc1 (Dense)                  (None, 4096)              102764544 
_________________________________________________________________
fc2 (Dense)                  (None, 4096)              16781312  
_________________________________________________________________
fc1024 (Dense)               (None, 1024)              4195328   
_________________________________________________________________
dropout_025 (Dropout)        (None, 1024)              0         
_________________________________________________________________
fc3 (Dense)                  (None, 3)                 3075      
=================================================================
Total params: 138,458,947
Trainable params: 4,198,403
Non-trainable params: 134,260,544
_________________________________________________________________

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
tdCNN (TimeDistributed)      (1, 1, 3)                 138458947 
_________________________________________________________________
lstm_1 (LSTM)                (1, 3)                    84        
_________________________________________________________________
dense_1 (Dense)              (1, 3)                    12        
=================================================================
Total params: 138,459,043
Trainable params: 4,198,499
Non-trainable params: 134,260,544
_________________________________________________________________

######## CONF_Begins_Here ##########
confFile = 'Stateful_FC_RNN_Configuration.py'
RECORD = True # False # 

output_begin = 3
num_outputs = 3

timesteps = 1 # TimeseriesGenerator Handles overlapping
learning_rate =  0.0001
in_epochs = 1
out_epochs = 1
eva_epoch = 1
train_batch_size = 1
test_batch_size = 1

subjectList = [i for i in range(1, 25)] # [1, 2, 3, 4, 5, 7, 8, 11, 12, 14] # [9] # 
testSubjects = [3, 5, 9, 14] # [9, 18, 21, 24] # [9] # 
trainingSubjects = [s for s in subjectList if not s in testSubjects] # subjectList # 

num_datasets = len(subjectList)

lstm_nodes = 3
lstm_dropout = 0.25
lstm_recurrent_dropout = 0.25
include_vgg_top = True # False # 

angles = ['Pitch', 'Yaw', 'Roll'] 
use_vgg16 = True # False # 
######### CONF_ends_Here ###########
1. set (Dataset 22) being trained for epoch 1 in Experiment 1 by 2019-01-29 22:31:02.647044!
2. set (Dataset 24) being trained for epoch 1 in Experiment 1 by 2019-01-29 22:31:24.629499!
3. set (Dataset 15) being trained for epoch 1 in Experiment 1 by 2019-01-29 22:31:42.463366!
4. set (Dataset 19) being trained for epoch 1 in Experiment 1 by 2019-01-29 22:32:02.700554!
5. set (Dataset 8) being trained for epoch 1 in Experiment 1 by 2019-01-29 22:32:22.061307!
6. set (Dataset 23) being trained for epoch 1 in Experiment 1 by 2019-01-29 22:32:46.004438!
7. set (Dataset 21) being trained for epoch 1 in Experiment 1 by 2019-01-29 22:33:05.646021!
8. set (Dataset 16) being trained for epoch 1 in Experiment 1 by 2019-01-29 22:33:28.596557!
9. set (Dataset 7) being trained for epoch 1 in Experiment 1 by 2019-01-29 22:33:58.072209!
10. set (Dataset 12) being trained for epoch 1 in Experiment 1 by 2019-01-29 22:34:22.622810!
11. set (Dataset 10) being trained for epoch 1 in Experiment 1 by 2019-01-29 22:34:46.518006!
12. set (Dataset 1) being trained for epoch 1 in Experiment 1 by 2019-01-29 22:35:08.322028!
13. set (Dataset 18) being trained for epoch 1 in Experiment 1 by 2019-01-29 22:35:26.205449!
14. set (Dataset 2) being trained for epoch 1 in Experiment 1 by 2019-01-29 22:35:45.955440!
15. set (Dataset 4) being trained for epoch 1 in Experiment 1 by 2019-01-29 22:36:05.634059!
16. set (Dataset 20) being trained for epoch 1 in Experiment 1 by 2019-01-29 22:36:28.840708!
17. set (Dataset 17) being trained for epoch 1 in Experiment 1 by 2019-01-29 22:36:45.968641!
18. set (Dataset 6) being trained for epoch 1 in Experiment 1 by 2019-01-29 22:37:00.170443!
19. set (Dataset 13) being trained for epoch 1 in Experiment 1 by 2019-01-29 22:37:17.352897!
20. set (Dataset 11) being trained for epoch 1 in Experiment 1 by 2019-01-29 22:37:34.436490!
Epoch 1 for Experiment 1 completed!
Exp2019-01-29_22-30-51_part1.h5 has been saved.
The subjects are trained: [(22, 'M01'), (24, 'M14'), (15, 'F03'), (19, 'M11'), (8, 'M02'), (23, 'M13'), (21, 'F02'), (16, 'M09'), (7, 'M01'), (12, 'M06'), (10, 'M04'), (1, 'F01'), (18, 'F05'), (2, 'F02'), (4, 'F04'), (20, 'M12'), (17, 'M10'), (6, 'F06'), (13, 'M07'), (11, 'M05')]
Evaluating model VGG16_inc_top_seqLen1_stateful_lstm3_output3_BatchSize1_inEpochs1_outEpochs1_AdamOpt_lr-0.000100_2019-01-29_22-30-51
The subjects will be tested: [(3, 'F03'), (5, 'F05'), (9, 'M03'), (14, 'M08')]
For the Subject 3 (F03):
Exp2019-01-29_22-30-51_part1.h5 has been saved.
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
tdCNN (TimeDistributed)      (1, 1, 3)                 138458947 
_________________________________________________________________
lstm_1 (LSTM)                (1, 3)                    84        
_________________________________________________________________
dense_1 (Dense)              (1, 3)                    12        
=================================================================
Total params: 138,459,043
Trainable params: 4,198,499
Non-trainable params: 134,260,544
_________________________________________________________________

######## CONF_Begins_Here ##########
confFile = 'Stateful_FC_RNN_Configuration.py'
RECORD = True # False # 

output_begin = 3
num_outputs = 3

timesteps = 1 # TimeseriesGenerator Handles overlapping
learning_rate =  0.0001
in_epochs = 1
out_epochs = 1
eva_epoch = 1
train_batch_size = 1
test_batch_size = 1

subjectList = [i for i in range(1, 25)] # [1, 2, 3, 4, 5, 7, 8, 11, 12, 14] # [9] # 
testSubjects = [3, 5, 9, 14] # [9, 18, 21, 24] # [9] # 
trainingSubjects = [s for s in subjectList if not s in testSubjects] # subjectList # 

num_datasets = len(subjectList)

lstm_nodes = 3
lstm_dropout = 0.25
lstm_recurrent_dropout = 0.25
include_vgg_top = True # False # 

angles = ['Pitch', 'Yaw', 'Roll'] 
use_vgg16 = True # False # 
######### CONF_ends_Here ###########
The subjects are trained: [(1, 'F01'), (2, 'F02'), (4, 'F04'), (6, 'F06'), (7, 'M01'), (8, 'M02'), (10, 'M04'), (11, 'M05'), (12, 'M06'), (13, 'M07'), (15, 'F03'), (16, 'M09'), (17, 'M10'), (18, 'F05'), (19, 'M11'), (20, 'M12'), (21, 'F02'), (22, 'M01'), (23, 'M13'), (24, 'M14')]
Evaluating model Exp2019-01-29_22-30-51_part1_and_2019-01-29_22-45-25
The subjects will be tested: [(3, 'F03'), (5, 'F05'), (9, 'M03'), (14, 'M08')]
For the Subject 3 (F03):
	The absolute mean error on Pitch angle estimation: 16.76 Degree
	The absolute mean error on Yaw angle estimation: 32.60 Degree
	The absolute mean error on Roll angle estimation: 8.88 Degree
For the Subject 5 (F05):
	The absolute mean error on Pitch angle estimation: 22.09 Degree
	The absolute mean error on Yaw angle estimation: 29.78 Degree
	The absolute mean error on Roll angle estimation: 4.27 Degree
For the Subject 9 (M03):
	The absolute mean error on Pitch angle estimation: 18.27 Degree
	The absolute mean error on Yaw angle estimation: 26.42 Degree
	The absolute mean error on Roll angle estimation: 8.43 Degree
For the Subject 14 (M08):
	The absolute mean error on Pitch angle estimation: 23.11 Degree
	The absolute mean error on Yaw angle estimation: 34.82 Degree
	The absolute mean error on Roll angle estimation: 14.15 Degree
On average in 4 test subjects:
	The absolute mean error on Pitch angle estimations: 20.06 Degree
	The absolute mean error on Yaw angle estimations: 30.90 Degree
	The absolute mean error on Roll angle estimations: 8.93 Degree
subject3_Exp1-29_22-30-51_part1_and_2019-01-29_22-45-25.png has been saved by 2019-01-29 22:46:55.747127.
subject5_Exp1-29_22-30-51_part1_and_2019-01-29_22-45-25.png has been saved by 2019-01-29 22:46:55.933824.
subject9_Exp1-29_22-30-51_part1_and_2019-01-29_22-45-25.png has been saved by 2019-01-29 22:46:56.120273.
subject14_Exp1-29_22-30-51_part1_and_2019-01-29_22-45-25.png has been saved by 2019-01-29 22:46:56.372783.
Model Exp1-29_22-30-51_part1_and_2019-01-29_22-45-25 has been evaluated successfully.
