Model Exp2019-01-29_22-52-23 has been started to be evaluated.
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 224, 224, 3)       0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 224, 224, 64)      1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 224, 224, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 112, 112, 64)      0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 112, 112, 128)     73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 112, 112, 128)     147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 56, 56, 128)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 56, 56, 256)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 28, 28, 256)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 28, 28, 512)       1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 14, 14, 512)       0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_pool (MaxPooling2D)   (None, 7, 7, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 25088)             0         
_________________________________________________________________
fc1 (Dense)                  (None, 4096)              102764544 
_________________________________________________________________
fc2 (Dense)                  (None, 4096)              16781312  
_________________________________________________________________
fc1024 (Dense)               (None, 1024)              4195328   
_________________________________________________________________
dropout_025 (Dropout)        (None, 1024)              0         
=================================================================
Total params: 138,455,872
Trainable params: 4,195,328
Non-trainable params: 134,260,544
_________________________________________________________________

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
tdCNN (TimeDistributed)      (1, 1, 1024)              138455872 
_________________________________________________________________
lstm_1 (LSTM)                (1, 500)                  3050000   
_________________________________________________________________
dense_1 (Dense)              (1, 3)                    1503      
=================================================================
Total params: 141,507,375
Trainable params: 7,246,831
Non-trainable params: 134,260,544
_________________________________________________________________

######## CONF_Begins_Here ##########
confFile = 'Stateful_FC_RNN_Configuration.py'
RECORD = True # False # 

output_begin = 3
num_outputs = 3

timesteps = 1 # TimeseriesGenerator Handles overlapping
learning_rate =  0.0001
in_epochs = 1
out_epochs = 1
eva_epoch = 1
train_batch_size = 1
test_batch_size = 1

subjectList = [i for i in range(1, 25)] # [1, 2, 3, 4, 5, 7, 8, 11, 12, 14] # [9] # 
testSubjects = [3, 5, 9, 14] # [9, 18, 21, 24] # [9] # 
trainingSubjects = [s for s in subjectList if not s in testSubjects] # subjectList # 

num_datasets = len(subjectList)

lstm_nodes = 500
lstm_dropout = 0.25
lstm_recurrent_dropout = 0.25
include_vgg_top = True # False # 

angles = ['Pitch', 'Yaw', 'Roll'] 
use_vgg16 = True # False # 
######### CONF_ends_Here ###########
1. set (Dataset 22) being trained for epoch 1 in Experiment 1 by 2019-01-29 22:52:33.996296!
2. set (Dataset 24) being trained for epoch 1 in Experiment 1 by 2019-01-29 22:52:57.371308!
3. set (Dataset 15) being trained for epoch 1 in Experiment 1 by 2019-01-29 22:53:17.209817!
4. set (Dataset 19) being trained for epoch 1 in Experiment 1 by 2019-01-29 22:53:38.684184!
5. set (Dataset 8) being trained for epoch 1 in Experiment 1 by 2019-01-29 22:54:00.068726!
6. set (Dataset 23) being trained for epoch 1 in Experiment 1 by 2019-01-29 22:54:25.374201!
7. set (Dataset 21) being trained for epoch 1 in Experiment 1 by 2019-01-29 22:54:45.436599!
8. set (Dataset 16) being trained for epoch 1 in Experiment 1 by 2019-01-29 22:55:09.611871!
9. set (Dataset 7) being trained for epoch 1 in Experiment 1 by 2019-01-29 22:55:42.521947!
10. set (Dataset 12) being trained for epoch 1 in Experiment 1 by 2019-01-29 22:56:08.384604!
11. set (Dataset 10) being trained for epoch 1 in Experiment 1 by 2019-01-29 22:56:33.893907!
12. set (Dataset 1) being trained for epoch 1 in Experiment 1 by 2019-01-29 22:56:57.438037!
13. set (Dataset 18) being trained for epoch 1 in Experiment 1 by 2019-01-29 22:57:16.346617!
14. set (Dataset 2) being trained for epoch 1 in Experiment 1 by 2019-01-29 22:57:36.936827!
15. set (Dataset 4) being trained for epoch 1 in Experiment 1 by 2019-01-29 22:57:58.068648!
16. set (Dataset 20) being trained for epoch 1 in Experiment 1 by 2019-01-29 22:58:22.371469!
17. set (Dataset 17) being trained for epoch 1 in Experiment 1 by 2019-01-29 22:58:40.172492!
18. set (Dataset 6) being trained for epoch 1 in Experiment 1 by 2019-01-29 22:58:55.224254!
19. set (Dataset 13) being trained for epoch 1 in Experiment 1 by 2019-01-29 22:59:14.738731!
20. set (Dataset 11) being trained for epoch 1 in Experiment 1 by 2019-01-29 22:59:32.978473!
Epoch 1 for Experiment 1 completed!
Exp2019-01-29_22-52-23_part1.h5 has been saved.
The subjects are trained: [(22, 'M01'), (24, 'M14'), (15, 'F03'), (19, 'M11'), (8, 'M02'), (23, 'M13'), (21, 'F02'), (16, 'M09'), (7, 'M01'), (12, 'M06'), (10, 'M04'), (1, 'F01'), (18, 'F05'), (2, 'F02'), (4, 'F04'), (20, 'M12'), (17, 'M10'), (6, 'F06'), (13, 'M07'), (11, 'M05')]
Evaluating model VGG16_inc_top_seqLen1_stateful_lstm500_output3_BatchSize1_inEpochs1_outEpochs1_AdamOpt_lr-0.000100_2019-01-29_22-52-23
The subjects will be tested: [(3, 'F03'), (5, 'F05'), (9, 'M03'), (14, 'M08')]
For the Subject 3 (F03):
	The absolute mean error on Pitch angle estimation: 10.83 Degree
	The absolute mean error on Yaw angle estimation: 55.79 Degree
	The absolute mean error on Roll angle estimation: 20.12 Degree
For the Subject 5 (F05):
	The absolute mean error on Pitch angle estimation: 12.46 Degree
	The absolute mean error on Yaw angle estimation: 29.36 Degree
	The absolute mean error on Roll angle estimation: 6.40 Degree
For the Subject 9 (M03):
	The absolute mean error on Pitch angle estimation: 16.75 Degree
	The absolute mean error on Yaw angle estimation: 32.89 Degree
	The absolute mean error on Roll angle estimation: 9.24 Degree
For the Subject 14 (M08):
	The absolute mean error on Pitch angle estimation: 15.59 Degree
	The absolute mean error on Yaw angle estimation: 25.72 Degree
	The absolute mean error on Roll angle estimation: 13.27 Degree
On average in 4 test subjects:
	The absolute mean error on Pitch angle estimations: 13.91 Degree
	The absolute mean error on Yaw angle estimations: 35.94 Degree
	The absolute mean error on Roll angle estimations: 12.26 Degree
Exp2019-01-29_22-52-23_part1 completed!
Exp2019-01-29_22-52-23.h5 has been saved.
subject3_Exp2019-01-29_22-52-23.png has been saved by 2019-01-29 23:01:16.454279.
subject5_Exp2019-01-29_22-52-23.png has been saved by 2019-01-29 23:01:16.655039.
subject9_Exp2019-01-29_22-52-23.png has been saved by 2019-01-29 23:01:16.854127.
subject14_Exp2019-01-29_22-52-23.png has been saved by 2019-01-29 23:01:17.073502.
Model Exp2019-01-29_22-52-23 has been evaluated successfully.
