Exp2019-01-22_22-49-31.h5 has been saved.
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
tdVGG16 (TimeDistributed)    (1, 1, 7, 7, 512)         14714688  
_________________________________________________________________
time_distributed_1 (TimeDist (1, 1, 25088)             0         
_________________________________________________________________
time_distributed_2 (TimeDist (1, 1, 25088)             0         
_________________________________________________________________
lstm_1 (LSTM)                (1, 500)                  51178000  
_________________________________________________________________
dense_1 (Dense)              (1, 3)                    1503      
=================================================================
Total params: 65,894,191
Trainable params: 51,179,503
Non-trainable params: 14,714,688
_________________________________________________________________

The subjects are trained: [(9, 'M03')]
Evaluating model Exp2019-01-22_22-49-31_and_2019-01-22_23-13-02
The subjects will be tested: [(9, 'M03')]
For the Subject 9 (M03):
Exp2019-01-22_22-49-31.h5 has been saved.
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
tdVGG16 (TimeDistributed)    (1, 1, 7, 7, 512)         14714688  
_________________________________________________________________
time_distributed_1 (TimeDist (1, 1, 25088)             0         
_________________________________________________________________
time_distributed_2 (TimeDist (1, 1, 25088)             0         
_________________________________________________________________
lstm_1 (LSTM)                (1, 500)                  51178000  
_________________________________________________________________
dense_1 (Dense)              (1, 3)                    1503      
=================================================================
Total params: 65,894,191
Trainable params: 51,179,503
Non-trainable params: 14,714,688
_________________________________________________________________

The subjects are trained: [(9, 'M03')]
Evaluating model Exp2019-01-22_22-49-31_and_2019-01-22_23-15-08
The subjects will be tested: [(9, 'M03')]
For the Subject 9 (M03):
	The absolute mean error on Pitch angle estimation: 7.00 Degree
	The absolute mean error on Yaw angle estimation: 5.87 Degree
	The absolute mean error on Roll angle estimation: 3.72 Degree
On average in 1 test subjects:
	The absolute mean error on Pitch angle estimations: 7.00 Degree
	The absolute mean error on Yaw angle estimations: 5.87 Degree
	The absolute mean error on Roll angle estimations: 3.72 Degree
subject9_Exp2019-01-22_22-49-31_and_2019-01-22_23-15-08.png has been saved by 2019-01-22 23:15:31.338559.
Model Exp2019-01-22_22-49-31_and_2019-01-22_23-15-08 has been evaluated successfully.
