Model Exp2019-01-19_18-59-27 has been started to be evaluated.
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 224, 224, 3)       0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 224, 224, 64)      1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 224, 224, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 112, 112, 64)      0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 112, 112, 128)     73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 112, 112, 128)     147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 56, 56, 128)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 56, 56, 256)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 28, 28, 256)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 28, 28, 512)       1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 14, 14, 512)       0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_pool (MaxPooling2D)   (None, 7, 7, 512)         0         
=================================================================
Total params: 14,714,688
Trainable params: 0
Non-trainable params: 14,714,688
_________________________________________________________________

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
tdVGG16 (TimeDistributed)    (None, 1, 7, 7, 512)      14714688  
_________________________________________________________________
time_distributed_1 (TimeDist (None, 1, 25088)          0         
_________________________________________________________________
lstm_1 (LSTM)                (None, 2)                 200728    
_________________________________________________________________
dense_1 (Dense)              (None, 3)                 9         
=================================================================
Total params: 14,915,425
Trainable params: 200,737
Non-trainable params: 14,714,688
_________________________________________________________________

1. set (Subject 9, M03) being trained for epoch 1!
Epoch 1 completed!
The subjects are trained: [(9, 'M03')]
Evaluating model VGG16_seqLen1_lstm2_output3_inEpochs1_outEpochs1_AdamOpt(lr=0.000100)_2019-01-19_18-59-27
The subjects will be tested: [(9, 'M03')]
For the Subject 24 (M14):
	The absolute mean error on Pitch angle estimation: 28.09 Degree
	The absolute mean error on Yaw angle estimation: 12.06 Degree
	The absolute mean error on Roll angle estimation: 6.40 Degree
On average in 1 test subjects:
	The absolute mean error on Pitch angle estimations: 28.09 Degree
	The absolute mean error on Yaw angle estimations: 12.06 Degree
	The absolute mean error on Roll angle estimations: 6.40 Degree
subject24_Exp2019-01-19_18-59-27.png has been saved by 2019-01-19 18:59:52.278717.
Model Exp2019-01-19_18-59-27 has been evaluated successfully.
