Model Exp2019-01-23_00-03-42 has been started to be evaluated.
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 224, 224, 3)       0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 224, 224, 64)      1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 224, 224, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 112, 112, 64)      0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 112, 112, 128)     73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 112, 112, 128)     147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 56, 56, 128)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 56, 56, 256)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 28, 28, 256)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 28, 28, 512)       1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 14, 14, 512)       0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_pool (MaxPooling2D)   (None, 7, 7, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 25088)             0         
_________________________________________________________________
fc1 (Dense)                  (None, 4096)              102764544 
_________________________________________________________________
fc2 (Dense)                  (None, 4096)              16781312  
=================================================================
Total params: 134,260,544
Trainable params: 0
Non-trainable params: 134,260,544
_________________________________________________________________

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
tdVGG16 (TimeDistributed)    (1, 1, 4096)              134260544 
_________________________________________________________________
time_distributed_1 (TimeDist (1, 1, 4096)              0         
_________________________________________________________________
fc10 (TimeDistributed)       (1, 1, 1024)              4195328   
_________________________________________________________________
time_distributed_2 (TimeDist (1, 1, 1024)              0         
_________________________________________________________________
lstm_1 (LSTM)                (1, 320)                  1721600   
_________________________________________________________________
dense_2 (Dense)              (1, 3)                    963       
=================================================================
Total params: 140,178,435
Trainable params: 5,917,891
Non-trainable params: 134,260,544
_________________________________________________________________

Training model VGG16_inc_top_seqLen1_stateful_lstm320_output3_BatchSize1_inEpochs1_outEpochs5_AdamOpt_lr-0.000100_2019-01-23_00-03-42
All frames and annotations from 1 datasets have been read by 2019-01-23 00:03:43.424604
1. set (Subject 9, M03) being trained for epoch 1!
Epoch 1/1
882/882 [==============================] - 23s 26ms/step - loss: 0.0834 - mean_absolute_error: 0.2243
Epoch 1 completed!
All frames and annotations from 1 datasets have been read by 2019-01-23 00:04:16.503743
1. set (Subject 9, M03) being trained for epoch 2!
Epoch 1/1
882/882 [==============================] - 22s 25ms/step - loss: 0.0252 - mean_absolute_error: 0.1244
Epoch 2 completed!
All frames and annotations from 1 datasets have been read by 2019-01-23 00:04:47.970509
1. set (Subject 9, M03) being trained for epoch 3!
Epoch 1/1
882/882 [==============================] - 22s 25ms/step - loss: 0.0176 - mean_absolute_error: 0.1028
Epoch 3 completed!
All frames and annotations from 1 datasets have been read by 2019-01-23 00:05:19.441639
1. set (Subject 9, M03) being trained for epoch 4!
Epoch 1/1
882/882 [==============================] - 21s 24ms/step - loss: 0.0133 - mean_absolute_error: 0.0887
Epoch 4 completed!
All frames and annotations from 1 datasets have been read by 2019-01-23 00:05:50.550838
1. set (Subject 9, M03) being trained for epoch 5!
Epoch 1/1
882/882 [==============================] - 22s 25ms/step - loss: 0.0104 - mean_absolute_error: 0.0780
Epoch 5 completed!
The subjects are trained: [(9, 'M03')]
Evaluating model VGG16_inc_top_seqLen1_stateful_lstm320_output3_BatchSize1_inEpochs1_outEpochs5_AdamOpt_lr-0.000100_2019-01-23_00-03-42
The subjects will be tested: [(9, 'M03')]
All frames and annotations from 1 datasets have been read by 2019-01-23 00:06:22.214857
For the Subject 9 (M03):
882
882/882 [==============================] - 29s 33ms/step
	The absolute mean error on Pitch angle estimation: 2.72 Degree
	The absolute mean error on Yaw angle estimation: 7.65 Degree
	The absolute mean error on Roll angle estimation: 2.73 Degree
On average in 1 test subjects:
	The absolute mean error on Pitch angle estimations: 2.72 Degree
	The absolute mean error on Yaw angle estimations: 7.65 Degree
	The absolute mean error on Roll angle estimations: 2.73 Degree
subject9_Exp2019-01-23_00-03-42.png has been saved by 2019-01-23 00:07:00.831529.
Model Exp2019-01-23_00-03-42 has been evaluated successfully.
