Exp2019-01-23_01-43-36.h5 has been saved.
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
tdVGG16 (TimeDistributed)    (1, 1, 4096)              134260544 
_________________________________________________________________
time_distributed_1 (TimeDist (1, 1, 4096)              0         
_________________________________________________________________
fc10 (TimeDistributed)       (1, 1, 1024)              4195328   
_________________________________________________________________
time_distributed_2 (TimeDist (1, 1, 1024)              0         
_________________________________________________________________
lstm_1 (LSTM)                (1, 320)                  1721600   
_________________________________________________________________
dense_2 (Dense)              (1, 3)                    963       
=================================================================
Total params: 140,178,435
Trainable params: 5,917,891
Non-trainable params: 134,260,544
_________________________________________________________________

1. set (Subject 9, M03) being trained for epoch 1!
