Model Exp2019-01-25_21-47-31 has been started to be evaluated.
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 224, 224, 3)       0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 224, 224, 64)      1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 224, 224, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 112, 112, 64)      0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 112, 112, 128)     73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 112, 112, 128)     147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 56, 56, 128)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 56, 56, 256)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 28, 28, 256)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 28, 28, 512)       1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 14, 14, 512)       0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_pool (MaxPooling2D)   (None, 7, 7, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 25088)             0         
_________________________________________________________________
fc1 (Dense)                  (None, 4096)              102764544 
_________________________________________________________________
fc2 (Dense)                  (None, 4096)              16781312  
=================================================================
Total params: 134,260,544
Trainable params: 0
Non-trainable params: 134,260,544
_________________________________________________________________

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
tdCNN (TimeDistributed)      (1, 1, 4096)              134260544 
_________________________________________________________________
dropout025_conv (TimeDistrib (1, 1, 4096)              0         
_________________________________________________________________
fc1024 (TimeDistributed)     (1, 1, 1024)              4195328   
_________________________________________________________________
dropout025 (TimeDistributed) (1, 1, 1024)              0         
_________________________________________________________________
fc3 (TimeDistributed)        (1, 1, 3)                 3075      
_________________________________________________________________
lstm_1 (LSTM)                (1, 10)                   560       
_________________________________________________________________
dense_3 (Dense)              (1, 3)                    33        
=================================================================
Total params: 138,459,540
Trainable params: 4,198,996
Non-trainable params: 134,260,544
_________________________________________________________________

######## CONF_Begins_Here ##########
confFile = 'Stateful_CNN_LSTM_Configuration.py'
RECORD = True # False # 

output_begin = 3
num_outputs = 3

timesteps = 1 # TimeseriesGenerator Handles overlapping
learning_rate =  0.0001
in_epochs = 1
out_epochs = 3
train_batch_size = 1
test_batch_size = 1

subjectList = [i for i in range(1, 25)] # [1, 2, 3, 4, 5, 7, 8, 11, 12, 14] # [9] # 
testSubjects = [3, 5, 9, 14] # [9, 18, 21, 24] # [1] # 
trainingSubjects = [s for s in subjectList if not s in testSubjects] # subjectList # 

num_datasets = len(subjectList)

lstm_nodes = 10
lstm_dropout = 0.25
lstm_recurrent_dropout = 0.25
include_vgg_top = True 

angles = ['Pitch', 'Yaw', 'Roll'] 
######### CONF_ends_Here ###########
1. set (Dataset 22) being trained for epoch 1 by 2019-01-25 21:47:42.127845!
2. set (Dataset 24) being trained for epoch 1 by 2019-01-25 21:48:05.672260!
3. set (Dataset 15) being trained for epoch 1 by 2019-01-25 21:48:24.851210!
4. set (Dataset 19) being trained for epoch 1 by 2019-01-25 21:48:46.512061!
5. set (Dataset 8) being trained for epoch 1 by 2019-01-25 21:49:06.891789!
6. set (Dataset 23) being trained for epoch 1 by 2019-01-25 21:49:31.711141!
7. set (Dataset 21) being trained for epoch 1 by 2019-01-25 21:49:52.129148!
8. set (Dataset 16) being trained for epoch 1 by 2019-01-25 21:50:17.031585!
9. set (Dataset 7) being trained for epoch 1 by 2019-01-25 21:50:47.753576!
10. set (Dataset 12) being trained for epoch 1 by 2019-01-25 21:51:14.169974!
11. set (Dataset 10) being trained for epoch 1 by 2019-01-25 21:51:40.355781!
12. set (Dataset 1) being trained for epoch 1 by 2019-01-25 21:52:04.022981!
13. set (Dataset 18) being trained for epoch 1 by 2019-01-25 21:52:22.369723!
14. set (Dataset 2) being trained for epoch 1 by 2019-01-25 21:52:43.091718!
15. set (Dataset 4) being trained for epoch 1 by 2019-01-25 21:53:03.348247!
16. set (Dataset 20) being trained for epoch 1 by 2019-01-25 21:53:27.682484!
17. set (Dataset 17) being trained for epoch 1 by 2019-01-25 21:53:45.131146!
18. set (Dataset 6) being trained for epoch 1 by 2019-01-25 21:54:00.020712!
19. set (Dataset 13) being trained for epoch 1 by 2019-01-25 21:54:17.726008!
20. set (Dataset 11) being trained for epoch 1 by 2019-01-25 21:54:35.986823!
Epoch 1 completed!
1. set (Dataset 6) being trained for epoch 2 by 2019-01-25 21:55:00.336519!
2. set (Dataset 11) being trained for epoch 2 by 2019-01-25 21:55:19.517829!
3. set (Dataset 10) being trained for epoch 2 by 2019-01-25 21:55:40.935609!
4. set (Dataset 4) being trained for epoch 2 by 2019-01-25 21:56:07.043105!
5. set (Dataset 23) being trained for epoch 2 by 2019-01-25 21:56:31.035354!
6. set (Dataset 13) being trained for epoch 2 by 2019-01-25 21:56:50.488569!
7. set (Dataset 17) being trained for epoch 2 by 2019-01-25 21:57:06.237974!
8. set (Dataset 1) being trained for epoch 2 by 2019-01-25 21:57:21.145009!
9. set (Dataset 8) being trained for epoch 2 by 2019-01-25 21:57:41.616639!
10. set (Dataset 7) being trained for epoch 2 by 2019-01-25 21:58:09.077665!
11. set (Dataset 21) being trained for epoch 2 by 2019-01-25 21:58:35.027346!
12. set (Dataset 22) being trained for epoch 2 by 2019-01-25 21:58:58.012074!
13. set (Dataset 2) being trained for epoch 2 by 2019-01-25 21:59:19.396022!
14. set (Dataset 24) being trained for epoch 2 by 2019-01-25 21:59:36.850312!
15. set (Dataset 15) being trained for epoch 2 by 2019-01-25 21:59:55.735098!
16. set (Dataset 20) being trained for epoch 2 by 2019-01-25 22:00:16.926903!
17. set (Dataset 18) being trained for epoch 2 by 2019-01-25 22:00:36.719189!
18. set (Dataset 19) being trained for epoch 2 by 2019-01-25 22:00:56.908603!
19. set (Dataset 12) being trained for epoch 2 by 2019-01-25 22:01:16.758834!
20. set (Dataset 16) being trained for epoch 2 by 2019-01-25 22:01:44.383620!
Epoch 2 completed!
1. set (Dataset 19) being trained for epoch 3 by 2019-01-25 22:02:16.425644!
2. set (Dataset 16) being trained for epoch 3 by 2019-01-25 22:02:37.497128!
3. set (Dataset 21) being trained for epoch 3 by 2019-01-25 22:03:06.680904!
4. set (Dataset 15) being trained for epoch 3 by 2019-01-25 22:03:28.811506!
5. set (Dataset 13) being trained for epoch 3 by 2019-01-25 22:03:50.112380!
6. set (Dataset 12) being trained for epoch 3 by 2019-01-25 22:04:09.586942!
7. set (Dataset 18) being trained for epoch 3 by 2019-01-25 22:04:33.888146!
8. set (Dataset 22) being trained for epoch 3 by 2019-01-25 22:04:54.862167!
9. set (Dataset 23) being trained for epoch 3 by 2019-01-25 22:05:17.409987!
10. set (Dataset 8) being trained for epoch 3 by 2019-01-25 22:05:39.363474!
11. set (Dataset 17) being trained for epoch 3 by 2019-01-25 22:06:03.228587!
12. set (Dataset 6) being trained for epoch 3 by 2019-01-25 22:06:18.566099!
13. set (Dataset 24) being trained for epoch 3 by 2019-01-25 22:06:36.997875!
14. set (Dataset 11) being trained for epoch 3 by 2019-01-25 22:06:55.263270!
15. set (Dataset 10) being trained for epoch 3 by 2019-01-25 22:07:17.480090!
16. set (Dataset 20) being trained for epoch 3 by 2019-01-25 22:07:41.197798!
17. set (Dataset 2) being trained for epoch 3 by 2019-01-25 22:08:00.202170!
18. set (Dataset 4) being trained for epoch 3 by 2019-01-25 22:08:20.514494!
19. set (Dataset 7) being trained for epoch 3 by 2019-01-25 22:08:46.941678!
20. set (Dataset 1) being trained for epoch 3 by 2019-01-25 22:09:11.292430!
Epoch 3 completed!
Exp2019-01-25_21-47-31.h5 has been saved.
The subjects are trained: [(19, 'M11'), (16, 'M09'), (21, 'F02'), (15, 'F03'), (13, 'M07'), (12, 'M06'), (18, 'F05'), (22, 'M01'), (23, 'M13'), (8, 'M02'), (17, 'M10'), (6, 'F06'), (24, 'M14'), (11, 'M05'), (10, 'M04'), (20, 'M12'), (2, 'F02'), (4, 'F04'), (7, 'M01'), (1, 'F01')]
Evaluating model VGG16_inc_top_seqLen1_stateful_lstm10_output3_BatchSize1_inEpochs1_outEpochs3_AdamOpt_lr-0.000100_2019-01-25_21-47-31
The subjects will be tested: [(3, 'F03'), (5, 'F05'), (9, 'M03'), (14, 'M08')]
For the Subject 3 (F03):
	The absolute mean error on Pitch angle estimation: 18.59 Degree
	The absolute mean error on Yaw angle estimation: 31.54 Degree
	The absolute mean error on Roll angle estimation: 8.00 Degree
For the Subject 5 (F05):
	The absolute mean error on Pitch angle estimation: 18.98 Degree
	The absolute mean error on Yaw angle estimation: 29.77 Degree
	The absolute mean error on Roll angle estimation: 3.78 Degree
For the Subject 9 (M03):
	The absolute mean error on Pitch angle estimation: 20.78 Degree
	The absolute mean error on Yaw angle estimation: 25.91 Degree
	The absolute mean error on Roll angle estimation: 8.00 Degree
For the Subject 14 (M08):
	The absolute mean error on Pitch angle estimation: 29.81 Degree
	The absolute mean error on Yaw angle estimation: 34.52 Degree
	The absolute mean error on Roll angle estimation: 14.20 Degree
On average in 4 test subjects:
	The absolute mean error on Pitch angle estimations: 22.04 Degree
	The absolute mean error on Yaw angle estimations: 30.44 Degree
	The absolute mean error on Roll angle estimations: 8.49 Degree
subject3_Exp2019-01-25_21-47-31.png has been saved by 2019-01-25 22:10:51.023742.
subject5_Exp2019-01-25_21-47-31.png has been saved by 2019-01-25 22:10:51.212333.
subject9_Exp2019-01-25_21-47-31.png has been saved by 2019-01-25 22:10:51.400980.
subject14_Exp2019-01-25_21-47-31.png has been saved by 2019-01-25 22:10:51.609004.
Model Exp2019-01-25_21-47-31 has been evaluated successfully.
