Model Exp2019-02-05_18-48-24 has been started to be evaluated.
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 224, 224, 3)       0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 224, 224, 64)      1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 224, 224, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 112, 112, 64)      0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 112, 112, 128)     73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 112, 112, 128)     147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 56, 56, 128)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 56, 56, 256)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 28, 28, 256)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 28, 28, 512)       1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 14, 14, 512)       0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_pool (MaxPooling2D)   (None, 7, 7, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 25088)             0         
_________________________________________________________________
fc1 (Dense)                  (None, 4096)              102764544 
_________________________________________________________________
fc2 (Dense)                  (None, 4096)              16781312  
_________________________________________________________________
dropout3_025 (Dropout)       (None, 4096)              0         
_________________________________________________________________
fc1024 (Dense)               (None, 1024)              4195328   
_________________________________________________________________
dropout_025 (Dropout)        (None, 1024)              0         
=================================================================
Total params: 138,455,872
Trainable params: 4,195,328
Non-trainable params: 134,260,544
_________________________________________________________________

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
tdCNN (TimeDistributed)      (10, 1, 1024)             138455872 
_________________________________________________________________
lstm_1 (LSTM)                (10, 320)                 1721600   
_________________________________________________________________
dense_1 (Dense)              (10, 3)                   963       
=================================================================
Total params: 140,178,435
Trainable params: 5,917,891
Non-trainable params: 134,260,544
_________________________________________________________________

######## CONF_Begins_Here ##########
confFile = 'Stateful_FC_RNN_Configuration.py'
RECORD = True # False # 

output_begin = 3
num_outputs = 3

timesteps = 1 # TimeseriesGenerator Handles overlapping
learning_rate =  0.0001
in_epochs = 1
out_epochs = 3
eva_epoch = 3
train_batch_size = 10
test_batch_size = 10

subjectList = [i for i in range(1, 25)] # [9] # [1, 2, 3, 4, 5, 7, 8, 11, 12, 14] # 
testSubjects = [6, 9, 14, 24] # [9, 18, 21, 24] # [9] # 
trainingSubjects = [s for s in subjectList if not s in testSubjects] # subjectList # 

num_datasets = len(subjectList)

lstm_nodes = 320
lstm_dropout = 0.25
lstm_recurrent_dropout = 0.25
include_vgg_top = True # False # 

angles = ['Pitch', 'Yaw', 'Roll'] 
use_vgg16 = True # False # 
######### CONF_ends_Here ###########
1. set (Dataset 21) being trained for epoch 1 in Experiment 1 by 2019-02-05 18:48:35.881316!
2. set (Dataset 23) being trained for epoch 1 in Experiment 1 by 2019-02-05 18:48:47.630076!
3. set (Dataset 13) being trained for epoch 1 in Experiment 1 by 2019-02-05 18:48:56.298012!
4. set (Dataset 18) being trained for epoch 1 in Experiment 1 by 2019-02-05 18:49:05.510559!
5. set (Dataset 7) being trained for epoch 1 in Experiment 1 by 2019-02-05 18:49:17.292758!
6. set (Dataset 22) being trained for epoch 1 in Experiment 1 by 2019-02-05 18:49:28.771121!
7. set (Dataset 20) being trained for epoch 1 in Experiment 1 by 2019-02-05 18:49:38.695887!
8. set (Dataset 15) being trained for epoch 1 in Experiment 1 by 2019-02-05 18:49:48.910312!
9. set (Dataset 5) being trained for epoch 1 in Experiment 1 by 2019-02-05 18:50:02.671812!
10. set (Dataset 11) being trained for epoch 1 in Experiment 1 by 2019-02-05 18:50:14.887977!
11. set (Dataset 8) being trained for epoch 1 in Experiment 1 by 2019-02-05 18:50:26.622426!
12. set (Dataset 1) being trained for epoch 1 in Experiment 1 by 2019-02-05 18:50:37.024384!
13. set (Dataset 17) being trained for epoch 1 in Experiment 1 by 2019-02-05 18:50:44.174892!
14. set (Dataset 2) being trained for epoch 1 in Experiment 1 by 2019-02-05 18:50:51.973774!
15. set (Dataset 3) being trained for epoch 1 in Experiment 1 by 2019-02-05 18:51:02.817329!
16. set (Dataset 19) being trained for epoch 1 in Experiment 1 by 2019-02-05 18:51:12.809752!
17. set (Dataset 16) being trained for epoch 1 in Experiment 1 by 2019-02-05 18:51:25.020004!
18. set (Dataset 4) being trained for epoch 1 in Experiment 1 by 2019-02-05 18:51:38.716511!
19. set (Dataset 12) being trained for epoch 1 in Experiment 1 by 2019-02-05 18:51:51.126731!
20. set (Dataset 10) being trained for epoch 1 in Experiment 1 by 2019-02-05 18:52:03.414471!
Epoch 1 for Experiment 1 completed!
1. set (Dataset 4) being trained for epoch 2 in Experiment 1 by 2019-02-05 18:52:20.837564!
2. set (Dataset 10) being trained for epoch 2 in Experiment 1 by 2019-02-05 18:52:33.233655!
3. set (Dataset 8) being trained for epoch 2 in Experiment 1 by 2019-02-05 18:52:46.003878!
4. set (Dataset 3) being trained for epoch 2 in Experiment 1 by 2019-02-05 18:52:58.641494!
5. set (Dataset 22) being trained for epoch 2 in Experiment 1 by 2019-02-05 18:53:10.103165!
6. set (Dataset 12) being trained for epoch 2 in Experiment 1 by 2019-02-05 18:53:21.946959!
7. set (Dataset 16) being trained for epoch 2 in Experiment 1 by 2019-02-05 18:53:35.739223!
8. set (Dataset 1) being trained for epoch 2 in Experiment 1 by 2019-02-05 18:53:47.098472!
9. set (Dataset 7) being trained for epoch 2 in Experiment 1 by 2019-02-05 18:53:58.075121!
10. set (Dataset 5) being trained for epoch 2 in Experiment 1 by 2019-02-05 18:54:12.382137!
11. set (Dataset 20) being trained for epoch 2 in Experiment 1 by 2019-02-05 18:54:24.276130!
12. set (Dataset 21) being trained for epoch 2 in Experiment 1 by 2019-02-05 18:54:34.098293!
13. set (Dataset 2) being trained for epoch 2 in Experiment 1 by 2019-02-05 18:54:43.513054!
14. set (Dataset 23) being trained for epoch 2 in Experiment 1 by 2019-02-05 18:54:52.504262!
15. set (Dataset 13) being trained for epoch 2 in Experiment 1 by 2019-02-05 18:55:01.198839!
16. set (Dataset 19) being trained for epoch 2 in Experiment 1 by 2019-02-05 18:55:09.373783!
17. set (Dataset 17) being trained for epoch 2 in Experiment 1 by 2019-02-05 18:55:16.607790!
18. set (Dataset 18) being trained for epoch 2 in Experiment 1 by 2019-02-05 18:55:25.170634!
19. set (Dataset 11) being trained for epoch 2 in Experiment 1 by 2019-02-05 18:55:35.160046!
20. set (Dataset 15) being trained for epoch 2 in Experiment 1 by 2019-02-05 18:55:45.476715!
Epoch 2 for Experiment 1 completed!
1. set (Dataset 18) being trained for epoch 3 in Experiment 1 by 2019-02-05 18:56:00.795299!
2. set (Dataset 15) being trained for epoch 3 in Experiment 1 by 2019-02-05 18:56:11.388228!
3. set (Dataset 20) being trained for epoch 3 in Experiment 1 by 2019-02-05 18:56:21.259907!
4. set (Dataset 13) being trained for epoch 3 in Experiment 1 by 2019-02-05 18:56:29.850883!
5. set (Dataset 12) being trained for epoch 3 in Experiment 1 by 2019-02-05 18:56:40.459298!
6. set (Dataset 11) being trained for epoch 3 in Experiment 1 by 2019-02-05 18:56:51.332809!
7. set (Dataset 17) being trained for epoch 3 in Experiment 1 by 2019-02-05 18:56:58.991533!
8. set (Dataset 21) being trained for epoch 3 in Experiment 1 by 2019-02-05 18:57:07.707593!
9. set (Dataset 22) being trained for epoch 3 in Experiment 1 by 2019-02-05 18:57:18.466355!
10. set (Dataset 7) being trained for epoch 3 in Experiment 1 by 2019-02-05 18:57:30.655915!
11. set (Dataset 16) being trained for epoch 3 in Experiment 1 by 2019-02-05 18:57:44.595028!
12. set (Dataset 4) being trained for epoch 3 in Experiment 1 by 2019-02-05 18:57:58.333884!
13. set (Dataset 23) being trained for epoch 3 in Experiment 1 by 2019-02-05 18:58:08.931193!
14. set (Dataset 10) being trained for epoch 3 in Experiment 1 by 2019-02-05 18:58:20.045976!
15. set (Dataset 8) being trained for epoch 3 in Experiment 1 by 2019-02-05 18:58:32.828355!
16. set (Dataset 19) being trained for epoch 3 in Experiment 1 by 2019-02-05 18:58:43.046697!
17. set (Dataset 2) being trained for epoch 3 in Experiment 1 by 2019-02-05 18:58:51.588140!
18. set (Dataset 3) being trained for epoch 3 in Experiment 1 by 2019-02-05 18:59:02.408765!
19. set (Dataset 5) being trained for epoch 3 in Experiment 1 by 2019-02-05 18:59:16.673142!
20. set (Dataset 1) being trained for epoch 3 in Experiment 1 by 2019-02-05 18:59:28.229133!
Epoch 3 for Experiment 1 completed!
Exp2019-02-05_18-48-24_part1.h5 has been saved.
The subjects are trained: [(18, 'F05'), (15, 'F03'), (20, 'M12'), (13, 'M07'), (12, 'M06'), (11, 'M05'), (17, 'M10'), (21, 'F02'), (22, 'M01'), (7, 'M01'), (16, 'M09'), (4, 'F04'), (23, 'M13'), (10, 'M04'), (8, 'M02'), (19, 'M11'), (2, 'F02'), (3, 'F03'), (5, 'F05'), (1, 'F01')]
Evaluating model VGG16_inc_top_seqLen1_stateful_lstm320_output3_BatchSize10_inEpochs1_outEpochs3_AdamOpt_lr-0.000100_2019-02-05_18-48-24
The subjects will be tested: [(6, 'F06'), (9, 'M03'), (14, 'M08'), (24, 'M14')]
For the Subject 6 (F06):
	The absolute mean error on Pitch angle estimation: 14.56 Degree
	The absolute mean error on Yaw angle estimation: 27.09 Degree
	The absolute mean error on Roll angle estimation: 17.10 Degree
For the Subject 9 (M03):
	The absolute mean error on Pitch angle estimation: 35.47 Degree
	The absolute mean error on Yaw angle estimation: 25.93 Degree
	The absolute mean error on Roll angle estimation: 8.41 Degree
For the Subject 14 (M08):
	The absolute mean error on Pitch angle estimation: 17.15 Degree
	The absolute mean error on Yaw angle estimation: 43.76 Degree
	The absolute mean error on Roll angle estimation: 13.63 Degree
For the Subject 24 (M14):
	The absolute mean error on Pitch angle estimation: 6.89 Degree
	The absolute mean error on Yaw angle estimation: 11.86 Degree
	The absolute mean error on Roll angle estimation: 7.50 Degree
On average in 4 test subjects:
	The absolute mean error on Pitch angle estimations: 18.52 Degree
	The absolute mean error on Yaw angle estimations: 27.16 Degree
	The absolute mean error on Roll angle estimations: 11.66 Degree
Exp2019-02-05_18-48-24_part1 completed!
Exp2019-02-05_18-48-24.h5 has been saved.
subject6_Exp2019-02-05_18-48-24.png has been saved by 2019-02-05 19:00:16.462263.
subject9_Exp2019-02-05_18-48-24.png has been saved by 2019-02-05 19:00:16.662257.
subject14_Exp2019-02-05_18-48-24.png has been saved by 2019-02-05 19:00:16.883125.
subject24_Exp2019-02-05_18-48-24.png has been saved by 2019-02-05 19:00:17.126088.
Model Exp2019-02-05_18-48-24 has been evaluated successfully.
