Model Exp2019-01-22_22-43-59 has been started to be evaluated.
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 224, 224, 3)       0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 224, 224, 64)      1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 224, 224, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 112, 112, 64)      0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 112, 112, 128)     73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 112, 112, 128)     147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 56, 56, 128)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 56, 56, 256)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 28, 28, 256)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 28, 28, 512)       1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 14, 14, 512)       0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_pool (MaxPooling2D)   (None, 7, 7, 512)         0         
=================================================================
Total params: 14,714,688
Trainable params: 0
Non-trainable params: 14,714,688
_________________________________________________________________

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
tdVGG16 (TimeDistributed)    (5, 1, 7, 7, 512)         14714688  
_________________________________________________________________
time_distributed_1 (TimeDist (5, 1, 25088)             0         
_________________________________________________________________
time_distributed_2 (TimeDist (5, 1, 25088)             0         
_________________________________________________________________
lstm_1 (LSTM)                (5, 500)                  51178000  
_________________________________________________________________
dense_1 (Dense)              (5, 3)                    1503      
=================================================================
Total params: 65,894,191
Trainable params: 51,179,503
Non-trainable params: 14,714,688
_________________________________________________________________

1. set (Subject 9, M03) being trained for epoch 1!
Epoch 1 completed!
1. set (Subject 9, M03) being trained for epoch 2!
Epoch 2 completed!
1. set (Subject 9, M03) being trained for epoch 3!
Epoch 3 completed!
1. set (Subject 9, M03) being trained for epoch 4!
Epoch 4 completed!
1. set (Subject 9, M03) being trained for epoch 5!
Epoch 5 completed!
1. set (Subject 9, M03) being trained for epoch 6!
Epoch 6 completed!
1. set (Subject 9, M03) being trained for epoch 7!
Epoch 7 completed!
1. set (Subject 9, M03) being trained for epoch 8!
Epoch 8 completed!
1. set (Subject 9, M03) being trained for epoch 9!
Epoch 9 completed!
1. set (Subject 9, M03) being trained for epoch 10!
Epoch 10 completed!
Exp2019-01-22_22-43-59.h5 has been saved.
The subjects are trained: [(9, 'M03')]
Evaluating model VGG16_seqLen1_stateful_lstm500_output3_inEpochs1_outEpochs10_AdamOpt_lr-0.000100_2019-01-22_22-43-59
The subjects will be tested: [(9, 'M03')]
For the Subject 9 (M03):
	The absolute mean error on Pitch angle estimation: 6.36 Degree
	The absolute mean error on Yaw angle estimation: 8.50 Degree
	The absolute mean error on Roll angle estimation: 8.31 Degree
On average in 1 test subjects:
	The absolute mean error on Pitch angle estimations: 6.36 Degree
	The absolute mean error on Yaw angle estimations: 8.50 Degree
	The absolute mean error on Roll angle estimations: 8.31 Degree
subject9_Exp2019-01-22_22-43-59.png has been saved by 2019-01-22 22:48:05.583947.
Model Exp2019-01-22_22-43-59 has been evaluated successfully.
