Model Exp2019-02-05_18-31-28 has been started to be evaluated.
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 224, 224, 3)       0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 224, 224, 64)      1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 224, 224, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 112, 112, 64)      0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 112, 112, 128)     73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 112, 112, 128)     147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 56, 56, 128)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 56, 56, 256)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 28, 28, 256)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 28, 28, 512)       1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 14, 14, 512)       0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_pool (MaxPooling2D)   (None, 7, 7, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 25088)             0         
_________________________________________________________________
fc1 (Dense)                  (None, 4096)              102764544 
_________________________________________________________________
fc2 (Dense)                  (None, 4096)              16781312  
_________________________________________________________________
fc1024 (Dense)               (None, 1024)              4195328   
_________________________________________________________________
dropout_025 (Dropout)        (None, 1024)              0         
=================================================================
Total params: 138,455,872
Trainable params: 4,195,328
Non-trainable params: 134,260,544
_________________________________________________________________

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
tdCNN (TimeDistributed)      (10, 1, 1024)             138455872 
_________________________________________________________________
lstm_1 (LSTM)                (10, 10)                  41400     
_________________________________________________________________
dense_1 (Dense)              (10, 3)                   33        
=================================================================
Total params: 138,497,305
Trainable params: 4,236,761
Non-trainable params: 134,260,544
_________________________________________________________________

######## CONF_Begins_Here ##########
confFile = 'Stateful_FC_RNN_Configuration.py'
RECORD = True # False # 

output_begin = 3
num_outputs = 3

timesteps = 1 # TimeseriesGenerator Handles overlapping
learning_rate =  0.0001
in_epochs = 1
out_epochs = 3
eva_epoch = 3
train_batch_size = 10
test_batch_size = 10

subjectList = [i for i in range(1, 25)] # [9] # [1, 2, 3, 4, 5, 7, 8, 11, 12, 14] # 
testSubjects = [6, 9, 14, 24] # [9, 18, 21, 24] # [9] # 
trainingSubjects = [s for s in subjectList if not s in testSubjects] # subjectList # 

num_datasets = len(subjectList)

lstm_nodes = 10
lstm_dropout = 0.25
lstm_recurrent_dropout = 0.25
include_vgg_top = True # False # 

angles = ['Pitch', 'Yaw', 'Roll'] 
use_vgg16 = True # False # 
######### CONF_ends_Here ###########
1. set (Dataset 21) being trained for epoch 1 in Experiment 1 by 2019-02-05 18:31:39.414394!
2. set (Dataset 23) being trained for epoch 1 in Experiment 1 by 2019-02-05 18:31:51.088220!
3. set (Dataset 13) being trained for epoch 1 in Experiment 1 by 2019-02-05 18:31:59.690313!
4. set (Dataset 18) being trained for epoch 1 in Experiment 1 by 2019-02-05 18:32:08.824938!
5. set (Dataset 7) being trained for epoch 1 in Experiment 1 by 2019-02-05 18:32:20.519676!
6. set (Dataset 22) being trained for epoch 1 in Experiment 1 by 2019-02-05 18:32:31.963919!
7. set (Dataset 20) being trained for epoch 1 in Experiment 1 by 2019-02-05 18:32:41.767311!
8. set (Dataset 15) being trained for epoch 1 in Experiment 1 by 2019-02-05 18:32:51.875522!
9. set (Dataset 5) being trained for epoch 1 in Experiment 1 by 2019-02-05 18:33:05.475886!
10. set (Dataset 11) being trained for epoch 1 in Experiment 1 by 2019-02-05 18:33:17.594473!
11. set (Dataset 8) being trained for epoch 1 in Experiment 1 by 2019-02-05 18:33:29.213132!
12. set (Dataset 1) being trained for epoch 1 in Experiment 1 by 2019-02-05 18:33:39.483480!
13. set (Dataset 17) being trained for epoch 1 in Experiment 1 by 2019-02-05 18:33:46.537415!
14. set (Dataset 2) being trained for epoch 1 in Experiment 1 by 2019-02-05 18:33:54.247686!
15. set (Dataset 3) being trained for epoch 1 in Experiment 1 by 2019-02-05 18:34:04.984314!
16. set (Dataset 19) being trained for epoch 1 in Experiment 1 by 2019-02-05 18:34:14.803517!
17. set (Dataset 16) being trained for epoch 1 in Experiment 1 by 2019-02-05 18:34:26.925396!
18. set (Dataset 4) being trained for epoch 1 in Experiment 1 by 2019-02-05 18:34:40.550140!
19. set (Dataset 12) being trained for epoch 1 in Experiment 1 by 2019-02-05 18:34:52.859797!
20. set (Dataset 10) being trained for epoch 1 in Experiment 1 by 2019-02-05 18:35:05.060248!
Epoch 1 for Experiment 1 completed!
1. set (Dataset 4) being trained for epoch 2 in Experiment 1 by 2019-02-05 18:35:22.320509!
2. set (Dataset 10) being trained for epoch 2 in Experiment 1 by 2019-02-05 18:35:34.575008!
3. set (Dataset 8) being trained for epoch 2 in Experiment 1 by 2019-02-05 18:35:47.246478!
4. set (Dataset 3) being trained for epoch 2 in Experiment 1 by 2019-02-05 18:35:59.789282!
5. set (Dataset 22) being trained for epoch 2 in Experiment 1 by 2019-02-05 18:36:11.164394!
6. set (Dataset 12) being trained for epoch 2 in Experiment 1 by 2019-02-05 18:36:22.929640!
7. set (Dataset 16) being trained for epoch 2 in Experiment 1 by 2019-02-05 18:36:36.684207!
8. set (Dataset 1) being trained for epoch 2 in Experiment 1 by 2019-02-05 18:36:47.910626!
9. set (Dataset 7) being trained for epoch 2 in Experiment 1 by 2019-02-05 18:36:58.834988!
10. set (Dataset 5) being trained for epoch 2 in Experiment 1 by 2019-02-05 18:37:13.064190!
11. set (Dataset 20) being trained for epoch 2 in Experiment 1 by 2019-02-05 18:37:24.855440!
12. set (Dataset 21) being trained for epoch 2 in Experiment 1 by 2019-02-05 18:37:34.590255!
13. set (Dataset 2) being trained for epoch 2 in Experiment 1 by 2019-02-05 18:37:43.950583!
14. set (Dataset 23) being trained for epoch 2 in Experiment 1 by 2019-02-05 18:37:52.875484!
15. set (Dataset 13) being trained for epoch 2 in Experiment 1 by 2019-02-05 18:38:01.504944!
16. set (Dataset 19) being trained for epoch 2 in Experiment 1 by 2019-02-05 18:38:09.640021!
17. set (Dataset 17) being trained for epoch 2 in Experiment 1 by 2019-02-05 18:38:16.767460!
18. set (Dataset 18) being trained for epoch 2 in Experiment 1 by 2019-02-05 18:38:25.298722!
19. set (Dataset 11) being trained for epoch 2 in Experiment 1 by 2019-02-05 18:38:35.114787!
20. set (Dataset 15) being trained for epoch 2 in Experiment 1 by 2019-02-05 18:38:45.357672!
Epoch 2 for Experiment 1 completed!
1. set (Dataset 18) being trained for epoch 3 in Experiment 1 by 2019-02-05 18:39:00.595031!
2. set (Dataset 15) being trained for epoch 3 in Experiment 1 by 2019-02-05 18:39:11.059836!
3. set (Dataset 20) being trained for epoch 3 in Experiment 1 by 2019-02-05 18:39:20.849948!
4. set (Dataset 13) being trained for epoch 3 in Experiment 1 by 2019-02-05 18:39:29.406834!
5. set (Dataset 12) being trained for epoch 3 in Experiment 1 by 2019-02-05 18:39:39.970104!
6. set (Dataset 11) being trained for epoch 3 in Experiment 1 by 2019-02-05 18:39:50.665794!
7. set (Dataset 17) being trained for epoch 3 in Experiment 1 by 2019-02-05 18:39:58.289332!
8. set (Dataset 21) being trained for epoch 3 in Experiment 1 by 2019-02-05 18:40:06.947812!
9. set (Dataset 22) being trained for epoch 3 in Experiment 1 by 2019-02-05 18:40:17.636943!
10. set (Dataset 7) being trained for epoch 3 in Experiment 1 by 2019-02-05 18:40:29.710231!
11. set (Dataset 16) being trained for epoch 3 in Experiment 1 by 2019-02-05 18:40:43.477786!
12. set (Dataset 4) being trained for epoch 3 in Experiment 1 by 2019-02-05 18:40:57.046621!
13. set (Dataset 23) being trained for epoch 3 in Experiment 1 by 2019-02-05 18:41:07.527356!
14. set (Dataset 10) being trained for epoch 3 in Experiment 1 by 2019-02-05 18:41:18.574140!
15. set (Dataset 8) being trained for epoch 3 in Experiment 1 by 2019-02-05 18:41:31.256146!
16. set (Dataset 19) being trained for epoch 3 in Experiment 1 by 2019-02-05 18:41:41.358746!
17. set (Dataset 2) being trained for epoch 3 in Experiment 1 by 2019-02-05 18:41:49.813798!
18. set (Dataset 3) being trained for epoch 3 in Experiment 1 by 2019-02-05 18:42:00.580025!
19. set (Dataset 5) being trained for epoch 3 in Experiment 1 by 2019-02-05 18:42:14.771242!
20. set (Dataset 1) being trained for epoch 3 in Experiment 1 by 2019-02-05 18:42:26.222851!
Epoch 3 for Experiment 1 completed!
Exp2019-02-05_18-31-28_part1.h5 has been saved.
The subjects are trained: [(18, 'F05'), (15, 'F03'), (20, 'M12'), (13, 'M07'), (12, 'M06'), (11, 'M05'), (17, 'M10'), (21, 'F02'), (22, 'M01'), (7, 'M01'), (16, 'M09'), (4, 'F04'), (23, 'M13'), (10, 'M04'), (8, 'M02'), (19, 'M11'), (2, 'F02'), (3, 'F03'), (5, 'F05'), (1, 'F01')]
Evaluating model VGG16_inc_top_seqLen1_stateful_lstm10_output3_BatchSize10_inEpochs1_outEpochs3_AdamOpt_lr-0.000100_2019-02-05_18-31-28
The subjects will be tested: [(6, 'F06'), (9, 'M03'), (14, 'M08'), (24, 'M14')]
For the Subject 6 (F06):
	The absolute mean error on Pitch angle estimation: 22.05 Degree
	The absolute mean error on Yaw angle estimation: 18.24 Degree
	The absolute mean error on Roll angle estimation: 15.01 Degree
For the Subject 9 (M03):
	The absolute mean error on Pitch angle estimation: 31.75 Degree
	The absolute mean error on Yaw angle estimation: 26.15 Degree
	The absolute mean error on Roll angle estimation: 6.98 Degree
For the Subject 14 (M08):
	The absolute mean error on Pitch angle estimation: 18.11 Degree
	The absolute mean error on Yaw angle estimation: 35.30 Degree
	The absolute mean error on Roll angle estimation: 13.99 Degree
For the Subject 24 (M14):
	The absolute mean error on Pitch angle estimation: 10.46 Degree
	The absolute mean error on Yaw angle estimation: 11.61 Degree
	The absolute mean error on Roll angle estimation: 6.35 Degree
On average in 4 test subjects:
	The absolute mean error on Pitch angle estimations: 20.59 Degree
	The absolute mean error on Yaw angle estimations: 22.83 Degree
	The absolute mean error on Roll angle estimations: 10.58 Degree
Exp2019-02-05_18-31-28_part1 completed!
