Model Exp2019-01-22_23-22-00 has been started to be evaluated.
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 224, 224, 3)       0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 224, 224, 64)      1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 224, 224, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 112, 112, 64)      0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 112, 112, 128)     73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 112, 112, 128)     147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 56, 56, 128)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 56, 56, 256)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 28, 28, 256)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 28, 28, 512)       1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 14, 14, 512)       0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_pool (MaxPooling2D)   (None, 7, 7, 512)         0         
=================================================================
Total params: 14,714,688
Trainable params: 0
Non-trainable params: 14,714,688
_________________________________________________________________

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
tdVGG16 (TimeDistributed)    (1, 1, 7, 7, 512)         14714688  
_________________________________________________________________
time_distributed_1 (TimeDist (1, 1, 25088)             0         
_________________________________________________________________
time_distributed_2 (TimeDist (1, 1, 25088)             0         
_________________________________________________________________
fc1024 (TimeDistributed)     (1, 1, 4096)              102764544 
_________________________________________________________________
time_distributed_3 (TimeDist (1, 1, 4096)              0         
_________________________________________________________________
fc104 (TimeDistributed)      (1, 1, 4096)              16781312  
_________________________________________________________________
time_distributed_4 (TimeDist (1, 1, 4096)              0         
_________________________________________________________________
fc10 (TimeDistributed)       (1, 1, 1024)              4195328   
_________________________________________________________________
time_distributed_5 (TimeDist (1, 1, 1024)              0         
_________________________________________________________________
lstm_1 (LSTM)                (1, 320)                  1721600   
_________________________________________________________________
dense_4 (Dense)              (1, 3)                    963       
=================================================================
Total params: 140,178,435
Trainable params: 125,463,747
Non-trainable params: 14,714,688
_________________________________________________________________

1. set (Subject 9, M03) being trained for epoch 1!
Epoch 1 completed!
1. set (Subject 9, M03) being trained for epoch 2!
Epoch 2 completed!
1. set (Subject 9, M03) being trained for epoch 3!
Epoch 3 completed!
1. set (Subject 9, M03) being trained for epoch 4!
Epoch 4 completed!
1. set (Subject 9, M03) being trained for epoch 5!
Epoch 5 completed!
1. set (Subject 9, M03) being trained for epoch 6!
Epoch 6 completed!
1. set (Subject 9, M03) being trained for epoch 7!
Epoch 7 completed!
1. set (Subject 9, M03) being trained for epoch 8!
Epoch 8 completed!
1. set (Subject 9, M03) being trained for epoch 9!
Epoch 9 completed!
1. set (Subject 9, M03) being trained for epoch 10!
Epoch 10 completed!
Exp2019-01-22_23-22-00.h5 has been saved.
The subjects are trained: [(9, 'M03')]
Evaluating model VGG16_seqLen1_stateful_lstm320_output3_BatchSize1_inEpochs1_outEpochs10_AdamOpt_lr-0.000100_2019-01-22_23-22-00
The subjects will be tested: [(9, 'M03')]
For the Subject 9 (M03):
	The absolute mean error on Pitch angle estimation: 23.59 Degree
	The absolute mean error on Yaw angle estimation: 26.15 Degree
	The absolute mean error on Roll angle estimation: 23.65 Degree
On average in 1 test subjects:
	The absolute mean error on Pitch angle estimations: 23.59 Degree
	The absolute mean error on Yaw angle estimations: 26.15 Degree
	The absolute mean error on Roll angle estimations: 23.65 Degree
subject9_Exp2019-01-22_23-22-00.png has been saved by 2019-01-22 23:38:35.104373.
Model Exp2019-01-22_23-22-00 has been evaluated successfully.
