Model Exp2019-01-29_18-33-37 has been started to be evaluated.
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 224, 224, 3)       0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 224, 224, 64)      1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 224, 224, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 112, 112, 64)      0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 112, 112, 128)     73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 112, 112, 128)     147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 56, 56, 128)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 56, 56, 256)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 28, 28, 256)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 28, 28, 512)       1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 14, 14, 512)       0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_pool (MaxPooling2D)   (None, 7, 7, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 25088)             0         
_________________________________________________________________
fc1 (Dense)                  (None, 4096)              102764544 
_________________________________________________________________
fc2 (Dense)                  (None, 4096)              16781312  
_________________________________________________________________
fc1024 (Dense)               (None, 1024)              4195328   
_________________________________________________________________
dropout_025 (Dropout)        (None, 1024)              0         
_________________________________________________________________
fc3 (Dense)                  (None, 3)                 3075      
=================================================================
Total params: 138,458,947
Trainable params: 4,198,403
Non-trainable params: 134,260,544
_________________________________________________________________

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
tdCNN (TimeDistributed)      (None, 16, 3)             138458947 
_________________________________________________________________
lstm_1 (LSTM)                (None, 20)                1920      
_________________________________________________________________
dense_1 (Dense)              (None, 3)                 63        
=================================================================
Total params: 138,460,930
Trainable params: 4,200,386
Non-trainable params: 134,260,544
_________________________________________________________________

######## CONF_Begins_Here ##########
confFile = 'Stateless_FC_RNN_Configuration.py'
RECORD = True # False # 

output_begin = 3
num_outputs = 3

timesteps = 16 # TimeseriesGenerator Handles overlapping
learning_rate =  0.0001
in_epochs = 1
out_epochs = 3
eva_epoch = 1
train_batch_size = 15
test_batch_size = 15

subjectList = [i for i in range(1, 25)] # [1, 2, 3, 4, 5, 7, 8, 11, 12, 14] # [9] # 
testSubjects = [3, 5, 9, 14] # [9, 18, 21, 24] # [9] # 
trainingSubjects = [s for s in subjectList if not s in testSubjects] # subjectList # 

num_datasets = len(subjectList)

lstm_nodes = 20
lstm_dropout = 0.25
lstm_recurrent_dropout = 0.25
include_vgg_top = True # False # 

angles = ['Pitch', 'Yaw', 'Roll'] 
use_vgg16 = True # False # 
######### CONF_ends_Here ###########
1. set (Dataset 22) being trained for epoch 1 in Experiment 1 by 2019-01-29 18:33:48.001375!
2. set (Dataset 24) being trained for epoch 1 in Experiment 1 by 2019-01-29 18:34:42.017000!
3. set (Dataset 15) being trained for epoch 1 in Experiment 1 by 2019-01-29 18:35:22.564638!
4. set (Dataset 19) being trained for epoch 1 in Experiment 1 by 2019-01-29 18:36:12.641561!
5. set (Dataset 8) being trained for epoch 1 in Experiment 1 by 2019-01-29 18:36:55.180145!
6. set (Dataset 23) being trained for epoch 1 in Experiment 1 by 2019-01-29 18:37:50.283437!
7. set (Dataset 21) being trained for epoch 1 in Experiment 1 by 2019-01-29 18:38:36.366803!
8. set (Dataset 16) being trained for epoch 1 in Experiment 1 by 2019-01-29 18:39:27.234619!
9. set (Dataset 7) being trained for epoch 1 in Experiment 1 by 2019-01-29 18:40:33.429016!
10. set (Dataset 12) being trained for epoch 1 in Experiment 1 by 2019-01-29 18:41:31.708912!
11. set (Dataset 10) being trained for epoch 1 in Experiment 1 by 2019-01-29 18:42:27.200636!
12. set (Dataset 1) being trained for epoch 1 in Experiment 1 by 2019-01-29 18:43:21.784724!
13. set (Dataset 18) being trained for epoch 1 in Experiment 1 by 2019-01-29 18:44:01.145195!
14. set (Dataset 2) being trained for epoch 1 in Experiment 1 by 2019-01-29 18:44:46.425125!
15. set (Dataset 4) being trained for epoch 1 in Experiment 1 by 2019-01-29 18:45:27.133001!
16. set (Dataset 20) being trained for epoch 1 in Experiment 1 by 2019-01-29 18:46:21.197357!
17. set (Dataset 17) being trained for epoch 1 in Experiment 1 by 2019-01-29 18:47:01.460080!
18. set (Dataset 6) being trained for epoch 1 in Experiment 1 by 2019-01-29 18:47:32.276591!
19. set (Dataset 13) being trained for epoch 1 in Experiment 1 by 2019-01-29 18:48:12.966962!
20. set (Dataset 11) being trained for epoch 1 in Experiment 1 by 2019-01-29 18:48:50.184364!
Epoch 1 for Experiment 1 completed!
Exp2019-01-29_18-33-37_part1.h5 has been saved.
The subjects are trained: [(22, 'M01'), (24, 'M14'), (15, 'F03'), (19, 'M11'), (8, 'M02'), (23, 'M13'), (21, 'F02'), (16, 'M09'), (7, 'M01'), (12, 'M06'), (10, 'M04'), (1, 'F01'), (18, 'F05'), (2, 'F02'), (4, 'F04'), (20, 'M12'), (17, 'M10'), (6, 'F06'), (13, 'M07'), (11, 'M05')]
Evaluating model VGG16_inc_top_seqLen16_lstm20_output3_BatchSize15_inEpochs1_outEpochs3_AdamOpt_lr-0.000100_2019-01-29_18-33-37
The subjects will be tested: [(3, 'F03'), (5, 'F05'), (9, 'M03'), (14, 'M08')]
For the Subject 3 (F03):
	The absolute mean error on Pitch angle estimation: 13.37 Degree
	The absolute mean error on Yaw angle estimation: 30.98 Degree
	The absolute mean error on Roll angle estimation: 17.86 Degree
For the Subject 5 (F05):
