Model Exp2019-02-05_03-44-23 has been started to be evaluated.
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 224, 224, 3)       0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 224, 224, 64)      1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 224, 224, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 112, 112, 64)      0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 112, 112, 128)     73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 112, 112, 128)     147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 56, 56, 128)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 56, 56, 256)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 28, 28, 256)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 28, 28, 512)       1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 14, 14, 512)       0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_pool (MaxPooling2D)   (None, 7, 7, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 25088)             0         
_________________________________________________________________
fc1 (Dense)                  (None, 4096)              102764544 
_________________________________________________________________
fc2 (Dense)                  (None, 4096)              16781312  
_________________________________________________________________
dropout_025 (Dropout)        (None, 4096)              0         
=================================================================
Total params: 134,260,544
Trainable params: 0
Non-trainable params: 134,260,544
_________________________________________________________________

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
tdCNN (TimeDistributed)      (10, 1, 4096)             134260544 
_________________________________________________________________
lstm_1 (LSTM)                (10, 10)                  164280    
_________________________________________________________________
dense_1 (Dense)              (10, 3)                   33        
=================================================================
Total params: 134,424,857
Trainable params: 164,313
Non-trainable params: 134,260,544
_________________________________________________________________

######## CONF_Begins_Here ##########
confFile = 'Stateful_FC_RNN_Configuration.py'
RECORD = True # False # 

output_begin = 3
num_outputs = 3

timesteps = 1 # TimeseriesGenerator Handles overlapping
learning_rate =  0.0001
in_epochs = 1
out_epochs = 1
eva_epoch = 1
train_batch_size = 10
test_batch_size = 10

subjectList = [i for i in range(1, 25)] # [9] # [1, 2, 3, 4, 5, 7, 8, 11, 12, 14] # 
testSubjects = [9, 18, 21, 24] # [9] # [5, 9, 14] # 
trainingSubjects = [s for s in subjectList if not s in testSubjects] # subjectList # 

num_datasets = len(subjectList)

lstm_nodes = 10
lstm_dropout = 0.25
lstm_recurrent_dropout = 0.25
include_vgg_top = True # False # 

angles = ['Pitch', 'Yaw', 'Roll'] 
use_vgg16 = True # False # 
######### CONF_ends_Here ###########
1. set (Dataset 20) being trained for epoch 1 in Experiment 1 by 2019-02-05 03:44:33.893369!
2. set (Dataset 23) being trained for epoch 1 in Experiment 1 by 2019-02-05 03:44:44.373319!
3. set (Dataset 12) being trained for epoch 1 in Experiment 1 by 2019-02-05 03:44:55.135867!
4. set (Dataset 16) being trained for epoch 1 in Experiment 1 by 2019-02-05 03:45:08.335660!
5. set (Dataset 6) being trained for epoch 1 in Experiment 1 by 2019-02-05 03:45:19.189759!
6. set (Dataset 22) being trained for epoch 1 in Experiment 1 by 2019-02-05 03:45:29.006610!
7. set (Dataset 19) being trained for epoch 1 in Experiment 1 by 2019-02-05 03:45:38.014238!
8. set (Dataset 13) being trained for epoch 1 in Experiment 1 by 2019-02-05 03:45:45.964291!
9. set (Dataset 5) being trained for epoch 1 in Experiment 1 by 2019-02-05 03:45:58.192426!
10. set (Dataset 10) being trained for epoch 1 in Experiment 1 by 2019-02-05 03:46:11.333801!
11. set (Dataset 7) being trained for epoch 1 in Experiment 1 by 2019-02-05 03:46:23.521125!
12. set (Dataset 1) being trained for epoch 1 in Experiment 1 by 2019-02-05 03:46:33.245634!
13. set (Dataset 15) being trained for epoch 1 in Experiment 1 by 2019-02-05 03:46:42.703998!
14. set (Dataset 2) being trained for epoch 1 in Experiment 1 by 2019-02-05 03:46:51.896661!
15. set (Dataset 3) being trained for epoch 1 in Experiment 1 by 2019-02-05 03:47:02.383508!
16. set (Dataset 17) being trained for epoch 1 in Experiment 1 by 2019-02-05 03:47:10.731249!
17. set (Dataset 14) being trained for epoch 1 in Experiment 1 by 2019-02-05 03:47:21.266399!
18. set (Dataset 4) being trained for epoch 1 in Experiment 1 by 2019-02-05 03:47:33.615051!
19. set (Dataset 11) being trained for epoch 1 in Experiment 1 by 2019-02-05 03:47:43.982217!
20. set (Dataset 8) being trained for epoch 1 in Experiment 1 by 2019-02-05 03:47:55.324164!
Epoch 1 for Experiment 1 completed!
Exp2019-02-05_03-44-23_part1.h5 has been saved.
The subjects are trained: [(20, 'M12'), (23, 'M13'), (12, 'M06'), (16, 'M09'), (6, 'F06'), (22, 'M01'), (19, 'M11'), (13, 'M07'), (5, 'F05'), (10, 'M04'), (7, 'M01'), (1, 'F01'), (15, 'F03'), (2, 'F02'), (3, 'F03'), (17, 'M10'), (14, 'M08'), (4, 'F04'), (11, 'M05'), (8, 'M02')]
Evaluating model VGG16_inc_top_seqLen1_stateful_lstm10_output3_BatchSize10_inEpochs1_outEpochs1_AdamOpt_lr-0.000100_2019-02-05_03-44-23
The subjects will be tested: [(9, 'M03'), (18, 'F05'), (21, 'F02'), (24, 'M14')]
For the Subject 9 (M03):
	The absolute mean error on Pitch angle estimation: 38.88 Degree
	The absolute mean error on Yaw angle estimation: 24.20 Degree
	The absolute mean error on Roll angle estimation: 8.54 Degree
For the Subject 18 (F05):
	The absolute mean error on Pitch angle estimation: 19.73 Degree
	The absolute mean error on Yaw angle estimation: 18.77 Degree
	The absolute mean error on Roll angle estimation: 10.93 Degree
For the Subject 21 (F02):
	The absolute mean error on Pitch angle estimation: 20.87 Degree
	The absolute mean error on Yaw angle estimation: 14.26 Degree
	The absolute mean error on Roll angle estimation: 16.57 Degree
For the Subject 24 (M14):
	The absolute mean error on Pitch angle estimation: 13.85 Degree
	The absolute mean error on Yaw angle estimation: 11.33 Degree
	The absolute mean error on Roll angle estimation: 6.49 Degree
On average in 4 test subjects:
	The absolute mean error on Pitch angle estimations: 23.33 Degree
	The absolute mean error on Yaw angle estimations: 17.14 Degree
	The absolute mean error on Roll angle estimations: 10.63 Degree
Exp2019-02-05_03-44-23_part1 completed!
Exp2019-02-05_03-44-23.h5 has been saved.
subject9_Exp2019-02-05_03-44-23.png has been saved by 2019-02-05 03:48:42.376348.
subject18_Exp2019-02-05_03-44-23.png has been saved by 2019-02-05 03:48:42.582335.
subject21_Exp2019-02-05_03-44-23.png has been saved by 2019-02-05 03:48:42.789713.
subject24_Exp2019-02-05_03-44-23.png has been saved by 2019-02-05 03:48:42.988066.
Model Exp2019-02-05_03-44-23 has been evaluated successfully.
