Model VGG16_seqLen16_lstm256_output3_inEpochs1_outEpochs1_AdamOpt(lr=0.000100)_2019-01-16_03-10-03 has been started to be evaluated.
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 224, 224, 3)       0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 224, 224, 64)      1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 224, 224, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 112, 112, 64)      0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 112, 112, 128)     73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 112, 112, 128)     147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 56, 56, 128)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 56, 56, 256)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 28, 28, 256)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 28, 28, 512)       1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 14, 14, 512)       0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_pool (MaxPooling2D)   (None, 7, 7, 512)         0         
=================================================================
Total params: 14,714,688
Trainable params: 0
Non-trainable params: 14,714,688
_________________________________________________________________

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
tdVGG16 (TimeDistributed)    (None, 16, 7, 7, 512)     14714688  
_________________________________________________________________
time_distributed_1 (TimeDist (None, 16, 25088)         0         
_________________________________________________________________
lstm_1 (LSTM)                (None, 256)               25953280  
_________________________________________________________________
dense_1 (Dense)              (None, 3)                 771       
=================================================================
Total params: 40,668,739
Trainable params: 25,954,051
Non-trainable params: 14,714,688
_________________________________________________________________

1. set (Subject 3, F04) being trained for epoch 1!
2. set (Subject 1, F02) being trained for epoch 1!
3. set (Subject 4, F05) being trained for epoch 1!
4. set (Subject 2, F03) being trained for epoch 1!
Epoch 1 completed!
The subjects are trained: [(3, 'F04'), (1, 'F02'), (4, 'F05'), (2, 'F03')]
Evaluating model VGG16_seqLen16_lstm256_output3_inEpochs1_outEpochs1_AdamOpt(lr=0.000100)_2019-01-16_03-10-03
The subjects will be tested: [(3, 'F04'), (1, 'F02'), (4, 'F05'), (2, 'F03')]
For the Subject 9 (M04):
	The absolute mean error on Pitch angle estimation: 18.01 Degree
	The absolute mean error on Yaw angle estimation: 20.57 Degree
	The absolute mean error on Roll angle estimation: 23.10 Degree
For the Subject 18 (M11):
	The absolute mean error on Pitch angle estimation: 55.72 Degree
	The absolute mean error on Yaw angle estimation: 38.64 Degree
	The absolute mean error on Roll angle estimation: 25.39 Degree
subject9_VGG16_seqLen16_lstm256_output3_inEpochs1_outEpochs1_AdamOpt(lr=0.000100)_2019-01-16_03-10-03.png has been saved by 2019-01-16 03:15:39.712884.
subject18_VGG16_seqLen16_lstm256_output3_inEpochs1_outEpochs1_AdamOpt(lr=0.000100)_2019-01-16_03-10-03.png has been saved by 2019-01-16 03:15:39.933829.
Model VGG16_seqLen16_lstm256_output3_inEpochs1_outEpochs1_AdamOpt(lr=0.000100)_2019-01-16_03-10-03 has been evaluated successfully.
